[
    {
        "page_content": "Mistborn is a series of epic fantasy novels written by American author Brandon Sanderson and published by Tor Books. The first trilogy, published between 2006 and 2008, consists of The Final Empire, The Well of Ascension, and The Hero of Ages. A second series was released between 2011 and 2022, and consists of the quartet The Alloy of Law, Shadows of Self, The Bands of Mourning and The Lost Metal. Sanderson also released a novella in 2016, Mistborn: Secret History. Sanderson plans to write a third and fourth series.\nThe first Mistborn trilogy chronicles the efforts of a secret group of Allomancers who attempt to overthrow a dystopian empire and establish themselves in a world covered by ash. The neologism Allomancer comes from two Greek words ἄλλος (allos) meaning otherly or different, and  μαντεία (manteía) meaning divination or sorcery, it indicates well the peculiar powers of this sect. The first trilogy was a huge success. This success pushed Sanderson to further develop his fictional universe, the Cosmere, which also includes The Stormlight Archive. Set about 300 years after the ending of the first trilogy, the second series is about the exploits of Waxillium Ladrian, a \"wild-west Deputy\" forced to move into the big city, and starts investigating kidnappings and robberies. The third series will be set in the early computer age with 1980s technology. The main character is planned as a Terris woman who is a computer programmer and Nicroburst; her brother is also planned to be a character. The fourth series is planned to be a space-opera.\n\n\n== Development history ==\nSanderson's first idea for Mistborn came while reading the Harry Potter series: He thought it would be interesting to set a story in a world where the \"dark lord\" triumphed and the \"prophesied hero\" failed. His second idea, originally unrelated, was to tell a heist story in a fantasy setting, an idea inspired by the Ocean's film series. The idea for the titular mist came while he was driving through mist in Idaho, which he combined with his memories of having once seen Washington National Cathedral lit from the inside. He originally developed feruchemy and allomancy for separate stories before deciding to bring them together in one story.Sanderson began work on Mistborn: The Final Empire while trying to get his earlier novel Elantris published. After writing two early iterations of Mistborn, he shifted his focus to his Stormlight Archive series, but chose to delay its publication in favor of completing the Mistborn series, which he thought would serve as a better follow-up to Elantris.\n\n\n=== Publication and future ===\nThe original trilogy published by Sanderson was the first in what he used to call a \"trilogy of trilogies.\" Sanderson planned to publish multiple trilogies all set on the fictional planet Scadrial but in different eras: the second trilogy was to be set in an urban setting, featuring modern technology, and the third trilogy was to be a science fiction series, set in the far future. However, this structure changed with the release of The Alloy of Law, which began a new series set between the first trilogy and the planned second trilogy. After some confusion, Sanderson decided to refer to the overall series in terms of four eras, with Era One being the first trilogy, Era Two being the four books starting with The Alloy of Law, and Eras Three and Four being the other planned trilogies.\n\n\n== Setting ==\nThe series primarily takes place in a region on the planet of Scadrial. The events of Era One primarily take place in Classical Scadrial, specifically within the Final Empire, while Era Two and beyond take place in Post-Catacendre Scadrial.\n\n\n=== Prehistory ===\nThe history of Scadrial started with Preservation and Ruin, two opposing gods who were Shards of Adonalsium, therefore fragments of the power of creation. Preservation's nature made him want to witness things that never ended, remaining unchanging and constant throughout infinity, whereas Ruin was d",
        "metadata": {
            "title": "Mistborn",
            "summary": "Mistborn is a series of epic fantasy novels written by American author Brandon Sanderson and published by Tor Books. The first trilogy, published between 2006 and 2008, consists of The Final Empire, The Well of Ascension, and The Hero of Ages. A second series was released between 2011 and 2022, and consists of the quartet The Alloy of Law, Shadows of Self, The Bands of Mourning and The Lost Metal. Sanderson also released a novella in 2016, Mistborn: Secret History. Sanderson plans to write a third and fourth series.\nThe first Mistborn trilogy chronicles the efforts of a secret group of Allomancers who attempt to overthrow a dystopian empire and establish themselves in a world covered by ash. The neologism Allomancer comes from two Greek words ἄλλος (allos) meaning otherly or different, and  μαντεία (manteía) meaning divination or sorcery, it indicates well the peculiar powers of this sect. The first trilogy was a huge success. This success pushed Sanderson to further develop his fictional universe, the Cosmere, which also includes The Stormlight Archive. Set about 300 years after the ending of the first trilogy, the second series is about the exploits of Waxillium Ladrian, a \"wild-west Deputy\" forced to move into the big city, and starts investigating kidnappings and robberies. The third series will be set in the early computer age with 1980s technology. The main character is planned as a Terris woman who is a computer programmer and Nicroburst; her brother is also planned to be a character. The fourth series is planned to be a space-opera.",
            "source": "https://en.wikipedia.org/wiki/Mistborn",
            "cleaned": "Mistborn is a series of epic fantasy novels written by Brandon Sanderson and published by Tor Books.\nThe first trilogy consists of The Final Empire, The Well of Ascension, and The Hero of Ages, published between 2006 and 2008.\nA second series, The Alloy of Law, Shadows of Self, The Bands of Mourning, and The Lost Metal, was released between 2011 and 2022.\nSanderson also released a novella in 2016, Mistborn: Secret History.\nThe first Mistborn trilogy follows a secret group of Allomancers trying to overthrow a dystopian empire.\nThe second series is set 300 years after the first trilogy and follows Waxillium Ladrian investigating kidnappings and robberies.\nThe third series will be set in the early computer age with 1980s technology.\nThe fourth series is planned to be a space-opera.\nSanderson's first idea for Mistborn was to set a story in a world where the \"dark lord\" triumphed and the \"prophesied hero\" failed.\nHis second idea was to tell a heist story in a fantasy setting.\nThe idea for the titular mist came to him while driving through mist in Idaho.\nSanderson originally developed feruchemy and allomancy for separate stories before combining them in Mistborn.\nSanderson began work on Mistborn: The Final Empire while trying to get his earlier novel Elantris published.\nSanderson planned to publish multiple trilogies set on the fictional planet Scadrial but in different eras.\nThe series primarily takes place in Classical Scadrial during Era One and in Post-Catacendre Scadrial during Era Two and beyond.\nThe history of Scadrial started with the opposing gods Preservation and Ruin, who were Shards of Adonalsium.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Mistborn: The Final Empire, also known simply as Mistborn or The Final Empire, is a fantasy novel written by American author Brandon Sanderson. It was published on July 17, 2006, by Tor Books and is the first novel in the Mistborn trilogy, followed by The Well of Ascension in 2007 and The Hero of Ages in 2008.\n\n\n== Synopsis ==\n\n\n=== Setting ===\nMistborn: The Final Empire is set on the dystopian world of Scadrial, where ash constantly falls from the sky, all plants are brown, and supernatural mists cloak the landscape every night. One thousand years before the start of the novel, the prophesied Hero of Ages ascended to godhood at the Well of Ascension in order to repel the Deepness, a terror threatening the world whose true nature has since been lost to time. Though the Deepness was successfully repelled and mankind saved, the world was changed into its current form by the Hero, who took the title \"Lord Ruler\" and has ruled over the Final Empire for a thousand years as an immortal tyrant and god. Under his rule, society is stratified into the nobility, believed to be the descendants of the friends and allies who helped him achieve godhood, and the brutally oppressed peasantry descended from those who opposed him, known as skaa.\nMagic is central to the Mistborn world. The most widely known discipline of magic is called Allomancy, which allows users to gain supernatural abilities by swallowing and \"burning\" specific metals. Allomantic potential is a genetic trait concentrated in the nobility, though skaa Allomancers also exist due to crossbreeding between the nobility and the skaa. Normal Allomancers have access to one Allomantic power, but an incredibly rare subset of Allomancers, called Mistborn, have access to every Allomantic power.\n\n\n=== Plot summary ===\nThree years prior to the start of the novel, a half-skaa thief named Kelsier discovered that he was Mistborn and escapes the Pits of Hathsin, a brutal prison camp of the Lord Ruler. He returned to Luthadel, the capital city of the Final Empire, where he rounded up his old thieving crew for a new job: to overthrow the Final Empire by stealing its treasury and collapsing its economy.\nAt the beginning of the novel, Vin, a wary and abused street urchin, is recruited by Kelsier's crew after Kelsier is notified by his brother, Marsh, that she is a Mistborn. Vin is trained by Kelsier's crew to develop her Allomantic powers, which include burning pewter to strengthen the body, burning tin to enhance the senses, and burning steel and iron to gain a limited form of telekinesis over metal. She is also given the duty of spying on the nobility by attending opulent balls in Luthadel (the capital and center of the final empire), where she poses as Valette Renoux, niece to Lord Renoux, a nobleman working with Kelsier's crew. During these balls, she meets and falls in love with Elend Venture, heir to House Venture, the most powerful of the Luthadel noble houses. Elend flouts the rules of nobility culture and secretly plans to build a better society with his noble friends when they ascend to their respective house titles.\nKelsier hopes to conquer the city by destabilizing it with a house war between the nobility and then invading with a skaa army. Once in control, he hopes to overthrow the Final Empire by stealing the Lord Ruler's hoard of atium, a precious metal which is the cornerstone of the Final Empire's economy. The crew succeeds in starting a house war by assassinating several powerful nobles and recruiting about seven thousand soldiers to join their cause. However, about three quarters of the soldiers are slaughtered when they foolishly attack an unimportant Final Empire garrison with the hopes of divine protection from Kelsier, who has spread rumors of his \"supernatural\" powers. The remaining soldiers are smuggled into Luthadel by Kelsier, who intends to continue the plan. Unfortunately, Marsh is discovered and seemingly killed, and Lord Renoux and his estate are seized and he is bro",
        "metadata": {
            "title": "Mistborn: The Final Empire",
            "summary": "Mistborn: The Final Empire, also known simply as Mistborn or The Final Empire, is a fantasy novel written by American author Brandon Sanderson. It was published on July 17, 2006, by Tor Books and is the first novel in the Mistborn trilogy, followed by The Well of Ascension in 2007 and The Hero of Ages in 2008.",
            "source": "https://en.wikipedia.org/wiki/Mistborn:_The_Final_Empire",
            "cleaned": "Mistborn: The Final Empire is a fantasy novel written by Brandon Sanderson. It was published on July 17, 2006, by Tor Books. The novel is set on the dystopian world of Scadrial, where ash constantly falls from the sky, plants are brown, and supernatural mists cover the landscape at night. The world is ruled by an immortal tyrant known as the Lord Ruler. Society is divided into nobility and oppressed peasantry called skaa. Magic, known as Allomancy, plays a central role in this world. The protagonist, Vin, is a street urchin who joins a crew led by Kelsier to overthrow the Final Empire. Vin is trained to develop her Allomantic powers and infiltrates the nobility. She falls in love with Elend Venture, who plans to build a better society. Kelsier's crew aims to start a house war and invade the city with a skaa army. Their ultimate goal is to steal the Lord Ruler's hoard of atium and overthrow the Final Empire.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Mistborn: The Well of Ascension is a fantasy novel written by American author Brandon Sanderson. It was published on August 21, 2007, by Tor Books and is the second novel in the Mistborn trilogy. It is preceded by The Final Empire in 2006 and followed by The Hero of Ages in 2008.\n\n\n== Plot summary ==\nThe Final Empire is in turmoil as various regions descend into anarchy following the Lord Ruler's death and the disappearance of the Steel Ministry. Elend Venture has claimed the crown of the capital city, Luthadel, and attempts to restore order, but various hostile forces converge on the city. Three armies lay siege to Luthadel because of its rumored wealth of Atium and political influence. The first army is led by Straff Venture - head of House Venture, and Elend's father. The second army is led by Ashweather Cett, self-declared king of the Western Dominance. The third army consists of Koloss, massive, brutish blue creatures once controlled by the Lord Ruler, and is led by Elend's former friend Jastes, who is buying the Koloss' obedience with counterfeit coins.\nVin and Elend discover a set of discarded bones in their keep, and with help from Vin's shapeshifting Kandra, OreSeur, realize that another Kandra has taken the form and identity of one of Kelsier's crew to spy on them. Vin becomes increasingly suspicious of everyone around her. At night, she begins sparring with Zane, Straff's Mistborn son and Elend's half brother. In the South, Sazed has come across suspicious deaths that appear to be caused by the mists. Marsh – Kelsier's brother and a Steel Inquisitor – leads Sazed to a Ministry stronghold called \"The Conventical of Seran,\" the former base of the Inquisitors. They discover an engraving that was authored by the Terrisman who once claimed to have found the Hero of Ages, which begins \"I write these words in steel, for anything not set in metal cannot be trusted.\" They leave quickly, Sazed taking a charcoal rubbing.  On their way back to Luthadel, Marsh disappears.\nThe Terris keeper Tindwyl arrives at Luthadel to train Elend to be a better king. Despite his personal improvements, the Assembly votes to depose Elend, using the very laws written by Elend, and elect Lord Penrod as their new king. Zane pressures Vin to kill her enemies and flee with him, abandoning the city. Misting assassins attack Elend at an Assembly meeting, and when Vin brutally kills them in front of Elend, their relationship deteriorates. At Zane's urging, Vin lashes out, slaughtering hundreds of Cett's soldiers at his temporary Luthadel mansion. She becomes disturbed by her actions and flees without killing Cett, who decides to leave the city and abandon his siege. Vin decides to choose Elend over Zane and refuses him. He tries to kill her, and reveals that the real OreSeur is dead, having been replaced by Zane's kandra, TenSoon. TenSoon has grown to like Vin, however, and he helps her kill Zane before returning to the kandra homeland. Feeling liberated, Vin accepts Elend's longstanding marriage proposal. Sazed and the rest of the crew scheme to get Elend and Vin out of the city before it falls, and Sazed creates a false map to the Well of Ascension, which Vin is convinced may be able to save them.\nSazed and Tindwyl have been studying the mysterious text left by the Terrisman Kwaan, which explains the events of the Lord Ruler's ascent. Kwaan had believed he had discovered the Hero of Ages in the person of Alendi, who rose to become a feared general and ruler known as the \"Conqueror\". However, Kwaan had become fearful for an obscure reason, believing that Alendi was not actually the Hero of Ages and became afraid of what would happen when he reached the Well of Ascension and tried to use the power within. To prevent this, Kwaan had instructed his nephew Rashek to mislead Alendi or kill him if he needed to. Rashek obeyed his uncle's command, but instead claimed the power for himself and became the Lord Ruler. Sazed and Tindwyl's research is complicated b",
        "metadata": {
            "title": "Mistborn: The Well of Ascension",
            "summary": "Mistborn: The Well of Ascension is a fantasy novel written by American author Brandon Sanderson. It was published on August 21, 2007, by Tor Books and is the second novel in the Mistborn trilogy. It is preceded by The Final Empire in 2006 and followed by The Hero of Ages in 2008.",
            "source": "https://en.wikipedia.org/wiki/Mistborn:_The_Well_of_Ascension",
            "cleaned": "Mistborn: The Well of Ascension is a fantasy novel written by Brandon Sanderson.\nIt was published on August 21, 2007, by Tor Books.\nIt is the second novel in the Mistborn trilogy, preceded by The Final Empire in 2006 and followed by The Hero of Ages in 2008.\nThe Final Empire is in turmoil after the Lord Ruler's death and the disappearance of the Steel Ministry.\nElend Venture, the new ruler of Luthadel, tries to restore order, but faces hostile forces.\nThree armies lay siege to Luthadel due to its rumored wealth of Atium and political influence.\nVin and Elend discover a spy among Kelsier's crew.\nVin becomes suspicious of everyone around her.\nSazed and Marsh investigate suspicious deaths caused by the mists.\nTindwyl arrives to train Elend as a better king.\nThe Assembly votes to depose Elend and elect Lord Penrod as the new king.\nZane pressures Vin to kill her enemies and flee with him.\nMisting assassins attack Elend at an Assembly meeting.\nVin kills the assassins, causing a strain in her relationship with Elend.\nVin slaughters Cett's soldiers at his mansion but feels disturbed by her actions.\nVin chooses Elend over Zane and kills Zane with TenSoon's help.\nVin accepts Elend's marriage proposal.\nSazed and the crew plan to get Vin and Elend out of the city.\nSazed and Tindwyl study the mysterious text left by Kwaan, explaining the Lord Ruler's ascent.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Mistborn: The Hero of Ages is an epic fantasy novel written by American author Brandon Sanderson. It was published on October 14, 2008, by Tor Books and is the third novel in the Mistborn trilogy. It is preceded by The Well of Ascension in 2007 and followed by The Alloy of Law in the Mistborn: Era 2 series, Wax and Wayne in 2011.\n\n\n== Plot summary ==\nThe Hero of Ages is the prophesied savior of the Terris people, foretold to find and give up the power at the Well of Ascension, in a selfless act to save the world from the Deepness. A thousand years before the fall of the Final Empire, the Terrisman Worldbringer Kwaan believed that he had found the Hero of Ages in Alendi, a blacksmith's son who rose to become the last ruler of Khlennium. However, as Alendi's quest for the Well continued, Kwaan discovered that the Terris prophecies had been altered by a mysterious force called Ruin, whose power was contained within the Well. If the Hero of Ages released the power as the prophecies claimed needed to be done, Ruin would be free to destroy the world. Kwaan betrayed Alendi, instructing his nephew Rashek to kill him. Rashek then claimed the power for himself, remaking the world and forming the Final Empire which he ruled as the immortal Lord Ruler. A thousand years later, the Mistborn Vin defeated the Lord Ruler and, tricked by the same prophecies, released the power from the Well of Ascension, freeing Ruin.\nRuin wanted to destroy the world instantaneously but his power was too weak, as part of it had been taken and hidden by the opposing force, Preservation, long ago. Freedom from the Well of Ascension enabled Ruin to directly affect the world more, increasing ashfall from the ashmounts and summoning earthquakes to break the world apart; he could also influence people and control entire koloss armies. He used his thousand years of imprisonment to plot his escape and the subsequent destruction he would reap. \nThe Lord Ruler, in preparation of such an event, created storage caches containing resources such as food and water in cave complexes beneath certain cities, each one providing directions to the next. As Vin and Elend struggle to consolidate the remaining outposts of humanity, they hunt the storage caches, seeking hints left by the Lord Ruler and the missing atium stash. As they journey from cache to cache, the world itself begins to crumble, ash spewing forth in greater quantities, while the mists claim more people. The last two major unconquered cities are Fadrex City, which has reverted to the Lord Ruler's old structure of mass oppression under the obligator Yomen, and Urteau, a rebel city where the Skaa are free, the nobility overpowered, and a former commoner titled the Citizen rules with increasing violence.\nSazed tries to establish diplomatic relations with the people of Urteau, while continuing to struggle with trauma from the recent death of his beloved, the Terriswoman Keeper Tindwyl. He studies religions, but has lost his own faith and yearns to find a religion that makes sense to him. He and Breeze work with Spook (who has developed strange abilities) to try and help Elend secretly take over Urteau. Meanwhile, TenSoon the kandra is imprisoned and sentenced to death by the kandra elders, while still trying to convince them that the kandra prophecies of the world ending are now happening, and that they must work together with the humans to save the world.\nVin and Elend try to conquer the city of Fadrex and discover more about how their world works; they discover strange patterns in the numbers of people dying after being exposed to the mists, as well as secrets regarding the art of Hemalurgy, which is used to create the koloss, the kandra, and the Inquisitors. Fearing that Ruin will discover their plans, they are unable to discuss their plans with each other. Yomen, the King of Fadrex City, captures Vin on an infiltration mission gone wrong. Elend, left without any choice, takes another koloss army under his control, bu",
        "metadata": {
            "title": "Mistborn: The Hero of Ages",
            "summary": "Mistborn: The Hero of Ages is an epic fantasy novel written by American author Brandon Sanderson. It was published on October 14, 2008, by Tor Books and is the third novel in the Mistborn trilogy. It is preceded by The Well of Ascension in 2007 and followed by The Alloy of Law in the Mistborn: Era 2 series, Wax and Wayne in 2011.",
            "source": "https://en.wikipedia.org/wiki/Mistborn:_The_Hero_of_Ages",
            "cleaned": "Mistborn: The Hero of Ages is an epic fantasy novel written by Brandon Sanderson.\nIt was published on October 14, 2008, by Tor Books.\nIt is the third novel in the Mistborn trilogy.\nThe Well of Ascension is the preceding novel in 2007.\nThe Alloy of Law is the follow-up novel in the Mistborn: Era 2 series, Wax and Wayne in 2011.\nThe Hero of Ages is the prophesied savior of the Terris people.\nThe Hero of Ages is foretold to find and give up the power at the Well of Ascension.\nThis selfless act is to save the world from the Deepness.\nA thousand years before the fall of the Final Empire, Kwaan believed he found the Hero of Ages in Alendi.\nAlendi was a blacksmith's son who became the last ruler of Khlennium.\nKwaan discovered that the Terris prophecies had been altered by a mysterious force called Ruin.\nRuin's power was contained within the Well of Ascension.\nIf the Hero of Ages released the power, Ruin would be free to destroy the world.\nKwaan betrayed Alendi and instructed Rashek to kill him.\nRashek claimed the power for himself and formed the Final Empire.\nThe Lord Ruler ruled the Final Empire as an immortal.\nA thousand years later, Mistborn Vin defeated the Lord Ruler.\nVin released the power from the Well of Ascension, freeing Ruin.\nRuin's power was too weak to destroy the world instantaneously.\nRuin's power had been taken and hidden by the opposing force, Preservation.\nFreedom from the Well of Ascension allowed Ruin to directly affect the world more.\nRuin increased ashfall and summoned earthquakes.\nRuin could influence people and control koloss armies.\nRuin plotted his escape and planned destruction.\nThe Lord Ruler created storage caches containing resources in cave complexes beneath certain cities.\nVin and Elend hunted the storage caches and sought hints left by the Lord Ruler.\nThey struggled to consolidate the remaining outposts of humanity.\nThey journeyed from cache to cache as the world crumbled.\nAsh spewed forth, and the mists claimed more people.\nThe last two major unconquered cities were Fadrex City and Urteau.\nFadrex City reverted to the Lord Ruler's old structure of mass oppression.\nUrteau was a rebel city where the Skaa were free.\nThe nobility was overpowered, and the Citizen ruled with increasing violence.\nSazed tried to establish diplomatic relations with the people of Urteau.\nSazed struggled with trauma from the recent death of Tindwyl.\nSazed studied religions and yearned to find a religion that made sense to him.\nSazed and Breeze worked with Spook to help Elend secretly take over Urteau.\nTenSoon the kandra was imprisoned and sentenced to death by the kandra elders.\nTenSoon tried to convince the kandra elders to work together with the humans to save the world.\nVin and Elend tried to conquer the city of Fadrex.\nThey discovered strange patterns in the numbers of people dying after being exposed to the mists.\nThey discovered secrets regarding the art of Hemalurgy.\nHemalurgy was used to create the koloss, the kandra, and the Inquisitors.\nVin was captured by Yomen, the King of Fadrex City.\nElend took another koloss army under his control.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Mistborn: The Alloy of Law is a fantasy novel written by American author Brandon Sanderson. It was published on November 8, 2011 by Tor Books and is the first book in the Wax and Wayne series and fourth in the Mistborn series. It is preceded by The Hero of Ages from the Mistborn Original Trilogy in 2008 and followed by Shadows of Self in 2015.\nThe story features Twinborns, Metalborns who are able to use Allomancy and Feruchemy in conjunction, along with abilities from new metals not present in the original trilogy.\n\n\n== Plot summary ==\nThe Alloy of Law is set in an analog to the early 20th century, on Scadrial, approximately 300 years after the conclusion of the original trilogy. It also introduces the concept of Twinborn, beings naturally born with one allomantic and one feruchemical ability, for the first time in the series.\nLawman Waxillium Ladrian and his partner Lessie are investigating a serial killer in Feltrel, a small town in the Roughs. They decide to split up and Wax follows the murderer's tracks, leading him into a small church, where he finds that Lessie had been captured and held hostage by the serial killer. While trying to free her, Wax accidentally kills Lessie.\nFive months after the death of Lessie, Wax has given up the role as peacekeeper, and returned to Elendel, where after the death of his uncle and sister (who were involved in a carriage accident), he has become the head of his house. Due to his uncle's inadequate financial operations, Wax is trying to save House Ladrian from bankruptcy. The only way to do it is to find a suitable high-born lady from a financially stable house to marry.\nJust before meeting with promising prospect Lady Steris and her father, Wax is unexpectedly visited by his friend, deputy, and master of disguise Wayne (who is also a Twinborn with the abilities to create speed bubbles, and store health in his goldminds), who has come to Elendel to investigate a series of robberies and kidnappings for which a rogue band called \"the Vanishers\" is responsible. He wants Wax's help to solve the case. Although still torn between his previous life as a lawman and his obligations to House Ladrian, Wax declines to join him. During the meeting with Lady Steris, her father, and her half-sister Marasi (who is posing as a distant cousin to Lady Steris, for she is illegitimately born), Wayne pretends to be Wax's distant uncle. Wax and Lady Steris come to an agreement to marry after several months of courting, and to introduce themselves as a couple to the elite society.\nAt a wedding party held by House Tekiel, the Vanishers show up and try to kidnap Steris and Marasi. Wax and Wayne, working as a team, manage to save Marasi, and kill most of the Vanishers when the event becomes violent. However, their leader and a few others slip away with Steris. Wax decides to solve the case and rescue his wife-to-be. After a careful recollection of the events at the wedding, Wax comes to the conclusion that the band is led by a former lawman named Miles, who is a Twinborn with the ability to cure any injury almost immediately.\nWayne discovers the bandits' hideout after interrogating one of the captives in police custody, and meets with Wax and Marasi in House Ladrian's mansion to share his findings. There Wax's butler tries to kill him, but the trio manage to escape.\nWax and Wayne, accompanied by Marasi, go to the bandits' hideout, and find it deserted, with minimal remaining evidence. They visit an old acquaintance – a gunsmith named Ranette - and form a plan to capture the bandits during their next robbery.\nWax deduces that the Vanishers will try to rob a train transporting large amounts of aluminium (which is extremely valuable due to its immunity to allomancy). He manages to slip into the cargo hold of the train. Meanwhile, Wayne and Marasi watch as the bandits switch the train's carts, and manage to follow them to their new hideout. There, after a long battle, in which all the bandits except Miles are killed, W",
        "metadata": {
            "title": "Mistborn: The Alloy of Law",
            "summary": "Mistborn: The Alloy of Law is a fantasy novel written by American author Brandon Sanderson. It was published on November 8, 2011 by Tor Books and is the first book in the Wax and Wayne series and fourth in the Mistborn series. It is preceded by The Hero of Ages from the Mistborn Original Trilogy in 2008 and followed by Shadows of Self in 2015.\nThe story features Twinborns, Metalborns who are able to use Allomancy and Feruchemy in conjunction, along with abilities from new metals not present in the original trilogy.",
            "source": "https://en.wikipedia.org/wiki/Mistborn:_The_Alloy_of_Law",
            "cleaned": "Mistborn: The Alloy of Law is a fantasy novel written by Brandon Sanderson.\nIt was published on November 8, 2011 by Tor Books.\nIt is the first book in the Wax and Wayne series and the fourth in the Mistborn series.\nThe story features Twinborns, Metalborns who can use Allomancy and Feruchemy together.\nThe Alloy of Law is set in an analog to the early 20th century on Scadrial.\nIt takes place approximately 300 years after the conclusion of the original trilogy.\nLawman Waxillium Ladrian and his partner Lessie are investigating a serial killer in Feltrel.\nWax accidentally kills Lessie while trying to free her from the serial killer's captivity.\nFive months later, Wax returns to Elendel and becomes the head of his house.\nHe is trying to save House Ladrian from bankruptcy by marrying a financially stable high-born lady.\nWax's friend Wayne visits him in Elendel and asks for his help in solving a series of robberies and kidnappings.\nWax declines to join Wayne due to his obligations to House Ladrian.\nWax meets Lady Steris and agrees to marry her after several months of courting.\nAt a wedding party, the Vanishers try to kidnap Steris and Marasi.\nWax and Wayne manage to save Marasi and kill most of the Vanishers.\nWax realizes that the band is led by a former lawman named Miles.\nWayne discovers the bandits' hideout and shares his findings with Wax and Marasi.\nWax, Wayne, and Marasi form a plan to capture the bandits during their next robbery.\nWax infiltrates a train while Wayne and Marasi follow the bandits to their new hideout.\nIn a battle, all the bandits except Miles are killed.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Mistborn: Secret History is a fantasy novella by American author Brandon Sanderson, written as a companion story to the original trilogy of the Mistborn series.The novella follows the story of Kelsier from Mistborn: The Final Empire and concludes with the events of the last book in the original trilogy, The Hero of Ages.\n\n\n== Conception ==\nSanderson published the novella, which was 12 years in the making, as an effort to tide fans over until the third book in The Stormlight Archive was published. The story was supposed to be a secret until published, but Amazon accidentally leaked the last few pages of The Bands of Mourning with the author's comments about the story in the novel's postscript. The author noted in a blog post that the novella contained huge spoilers for the original Mistborn trilogy as well as minor spoilers to The Bands of Mourning, warning readers that knowledge of the story's existence was in itself, a spoiler.\n\n\n== Plot summary ==\nAfter being killed by the Lord Ruler, Kelsier meets Preservation as he is about to pass on to the spiritual realm. Kelsier refuses to do so and races to the Well of Ascension at the heart of the Lord Ruler's palace, touching its power and thus anchoring himself to the world. Whilst trapped at the Well, he discovers another entity trapped there: Ruin, the counterpart to Preservation, who intends to destroy the world.\nWhen Vin accidentally frees Ruin when she gives up the power at the Well, Kelsier is also released. With the world now under direct threat from Ruin, a dying Preservation tasks Kelsier to find help. Following Preservation's guidance, Kelsier meets two people from different worlds, Khriss and Nazh, who point him to a covert group known as the Ire (Eyree) as his only chance for aid.\nDespite Ruin's dissuasion, Kelsier travels to the Ire's fortress. He discovers that they are planning to steal Preservation's powers once he dies by using a strange artifact. Kelsier dupes the group by posing as Ruin and steals the artifact for himself. When he returns to his world, Preservation tells him that he cannot pass on his powers to Vin because she has been spiked by Ruin. When Preservation finally dies, Kelsier takes up the power using the stolen artifact. Trying and failing to contact Vin because of Ruin's interference and his inexperience with Preservation's powers, Kelsier decides to instead travel to Urteau and succeeds in freeing Spook from Ruin's influence.\nUnder Kelsier's command, Spook sends a message to Vin about her spike and Ruin's influence on her. However, Ruin intercepts and kills the messenger using Marsh, Kelsier's brother, who is now under Ruin's control. They then witness Vin's battle and subsequent defeat at the hands of Marsh and the other Steel Inquisitors. With Ruin's rage loosening his control, Marsh manages to use the intercepted message as Kelsier secretly intended and removes Vin's earring spike. Kelsier gives up Preservation's power to Vin, who uses it to kill the other Steel Inquisitors - but she ascends before she can finish Marsh.\nKelsier realizes that Ruin's power is incomplete until he finds the Lord Ruler's hidden cache of atium. He watches the battle at the Pits of Hathsin and Elend Venture's death at Marsh's hands. With her husband's death, Vin sacrifices herself to kill Ruin. Kelsier's long-time friend, Sazed takes up the powers of both Preservation and Ruin, ascending as Harmony. Kelsier tearfully reunites with Vin and watches as she too chooses to pass on to the Afterlife with Elend. After Harmony remakes the world, Kelsier speaks to Spook and recruits his help in getting him a new \"string\" to the physical realm.\n\n\n== Characters ==\nKelsier: The famed Survivor of Hathsin, a half-skaa Mistborn who led a revolution against the Lord Ruler. At the novella's beginning, Kelsier is killed by the Lord Ruler but refuses to pass on to the Beyond, and instead becomes trapped in the Cognitive Realm, between the Physical and Spiritual realms.\nPreservation: A g",
        "metadata": {
            "title": "Mistborn: Secret History",
            "summary": "Mistborn: Secret History is a fantasy novella by American author Brandon Sanderson, written as a companion story to the original trilogy of the Mistborn series.The novella follows the story of Kelsier from Mistborn: The Final Empire and concludes with the events of the last book in the original trilogy, The Hero of Ages.",
            "source": "https://en.wikipedia.org/wiki/Mistborn:_Secret_History",
            "cleaned": "Mistborn: Secret History is a fantasy novella by Brandon Sanderson. It is a companion story to the original trilogy of the Mistborn series. The novella follows the story of Kelsier from Mistborn: The Final Empire and concludes with the events of the last book in the original trilogy, The Hero of Ages.\n\nThe novella was published by Sanderson as an effort to tide fans over until the third book in The Stormlight Archive was published. It was supposed to be a secret until published, but Amazon accidentally leaked the last few pages of The Bands of Mourning with the author's comments about the story in the novel's postscript.\n\nAfter being killed by the Lord Ruler, Kelsier meets Preservation as he is about to pass on to the spiritual realm. Kelsier refuses to do so and races to the Well of Ascension at the heart of the Lord Ruler's palace, anchoring himself to the world. He discovers another entity trapped there: Ruin, the counterpart to Preservation, who intends to destroy the world.\n\nWhen Vin accidentally frees Ruin, Kelsier is also released. With the world now under direct threat from Ruin, a dying Preservation tasks Kelsier to find help. Kelsier meets two people from different worlds, Khriss and Nazh, who point him to a covert group known as the Ire as his only chance for aid.\n\nKelsier travels to the Ire's fortress and discovers their plan to steal Preservation's powers. He dupes the group and steals the artifact for himself. When Preservation dies, Kelsier takes up the power using the stolen artifact. He tries to contact Vin but fails due to Ruin's interference. Instead, he travels to Urteau and frees Spook from Ruin's influence.\n\nUnder Kelsier's command, Spook sends a message to Vin about her spike and Ruin's influence. However, Ruin intercepts and kills the messenger using Marsh, Kelsier's brother. They witness Vin's battle and defeat at the hands of Marsh and the Steel Inquisitors. Marsh removes Vin's earring spike, and she uses Preservation's power to kill the other Steel Inquisitors before ascending.\n\nKelsier realizes that Ruin's power is incomplete until he finds the Lord Ruler's hidden cache of atium. He witnesses Elend Venture's death at Marsh's hands. Vin sacrifices herself to kill Ruin. Sazed takes up the powers of both Preservation and Ruin, ascending as Harmony. Kelsier reunites with Vin and watches as she chooses to pass on to the Afterlife with Elend. After Harmony remakes the world, Kelsier speaks to Spook and recruits his help in getting him a new \"string\" to the physical realm.\n\nCharacters:\n- Kelsier: The famed Survivor of Hathsin, a half-skaa Mistborn who led a revolution against the Lord Ruler. At the novella's beginning, Kelsier is killed by the Lord Ruler but refuses to pass on to the Beyond, and instead becomes trapped in the Cognitive Realm, between the Physical and Spiritual realms.\n- Preservation: A",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Mistborn: The Bands of Mourning is a steampunk fantasy novel written by American author Brandon Sanderson. It was published on January 26, 2016, by Tor Books and is the third book in the Wax and Wayne series and sixth in the Mistborn series. It is preceded by Shadows of Self in 2015 and followed by The Lost Metal in 2022.\n\n\n== Plot summary ==\nIn a flashback, Waxillium Ladrian is spending a year in the Terris Village while he is a teenager. Unlike his sister Telsin, he struggles to adapt to their ways, and when he discovers and kills a Terris murderer whom the Terris failed to apprehend, he decides to depart the village. Years later, Wax has mostly emotionally recovered from Lessie's death, and is about to marry Steris. However, Wayne secretly sabotages the wedding so that it is unfinished.\nA kandra named VenDell makes contact with Wax, seeking help on a mission, but when Wax refuses, VenDell recruits Marasi instead. Wax listens in as VenDell explains how another kandra, ReLuur, found evidence of the existence of the Bands of Mourning: the Lord Ruler's arm braces, which may be able to grant anyone the powers of an allomancer and a feruchemist. However, ReLuur was attacked by the Set and lost one of his spikes. Marasi agrees to hunt the spike, and Wax agrees to tag along when a picture reveals that his sister may be in New Seran, where ReLuur was ambushed. VenDell also says that Harmony has been preoccupied with something big lately.\nWax, Marasi, Wayne, Steris, and MeLaan make their way to New Seran under the guise of a diplomatic mission. Tensions have grown between Elendel and the outer cities, with a war possibly imminent. Marasi acquires a strange cubic device from bandits after she and Wax foil a train robbery. At New Seran, Wax attends a party held by prominent noblewoman Lady Kelesina Shores, after acquiring a strange coin and partially uncovering a conspiracy Kelesina is involved in. Kelesina contacts Wax's uncle Edwarn, who has Kelesina killed and frames Wax. Steris proves useful at the party, both for the infiltration and the subsequent escape. Meanwhile, Wayne and Marasi raid a graveyard where they believe the spike to be, but cannot find it. They do learn, however, that there is a strange project going on in the nearby town of Dulsing, connected to the Set.\nThe group flees the city and heads for Dulsing. Marasi discovers that her cube can absorb and replicate Allomantic powers when thrown. At Dulsing, the group infiltrates a Set warehouse and discovers a massive, damaged warship, which the Set is both repairing and researching. Marasi recovers the spike and rescues a strange, imprisoned man who wears a wooden mask; she also finds evidence that other mask-wearing people have been tortured and murdered there. Wax rescues Telsin, but a shootout ensues. The masked man leads Marasi, Wax, and the others into a hidden compartment aboard the ship, which is actually a smaller ship hidden inside. The man reveals the ships are flying vehicles powered by Allomancy, and with Wax's power they use the vehicle to escape.\nThe man, Allik, uses a strange medallion to communicate with them; he reveals many of the medallions, which have the ability to grant a variety of Allomantic and Feruchemical abilities to anyone who wears them. He comes from a region beyond the Roughs that froze when Harmony remade the world, and claims that his people were then saved by the Lord Ruler, who reappeared with a spike through his right eye after Harmony's ascension. Allik and his people were also seeking the Bands of Mourning, which are hidden at a temple in a nearby mountain range, when they crashed and were taken by the Set. The group sets course for the temple, hoping they can reach it before Edwarn Ladrian and his expedition team do.\nWax's group find the temple and disable its traps, but cannot get through the final door. The Set expedition arrives, and Edwarn, under a banner of truce, opens the final door so that they may all enter. They find the t",
        "metadata": {
            "title": "Mistborn: The Bands of Mourning",
            "summary": "Mistborn: The Bands of Mourning is a steampunk fantasy novel written by American author Brandon Sanderson. It was published on January 26, 2016, by Tor Books and is the third book in the Wax and Wayne series and sixth in the Mistborn series. It is preceded by Shadows of Self in 2015 and followed by The Lost Metal in 2022.",
            "source": "https://en.wikipedia.org/wiki/Mistborn:_The_Bands_of_Mourning",
            "cleaned": "Mistborn: The Bands of Mourning is a steampunk fantasy novel written by Brandon Sanderson.\nIt was published on January 26, 2016, by Tor Books.\nIt is the third book in the Wax and Wayne series and sixth in the Mistborn series.\nIt is preceded by Shadows of Self in 2015 and followed by The Lost Metal in 2022.\nIn a flashback, Waxillium Ladrian spends a year in the Terris Village as a teenager.\nHe struggles to adapt to their ways and decides to leave the village after killing a Terris murderer.\nYears later, Wax is about to marry Steris, but the wedding is sabotaged by Wayne.\nA kandra named VenDell contacts Wax for help on a mission, but Wax refuses.\nVenDell recruits Marasi instead, and they search for evidence of the Bands of Mourning.\nWax, Marasi, Wayne, Steris, and MeLaan go to New Seran under the guise of a diplomatic mission.\nTensions rise between Elendel and the outer cities, and a war may be imminent.\nMarasi acquires a strange cubic device from bandits during a train robbery.\nWax attends a party held by Lady Kelesina Shores and uncovers a conspiracy.\nWax's uncle Edwarn frames him for Kelesina's murder.\nThe group heads to Dulsing and infiltrates a Set warehouse.\nThey discover a damaged warship being repaired and researched by the Set.\nMarasi recovers the spike and rescues a strange, imprisoned man.\nWax rescues his sister Telsin, but a shootout occurs.\nThe group escapes on a hidden flying ship powered by Allomancy.\nAllik, the masked man, communicates with them and reveals the medallions' abilities.\nAllik's people were seeking the Bands of Mourning before being captured by the Set.\nThe group sets course for a temple in a nearby mountain range.\nThey disable the temple's traps but cannot open the final door.\nThe Set expedition arrives, and Edwarn opens the final door under a truce.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Mistborn: Shadows of Self is a  fantasy novel written by American author Brandon Sanderson. It was published  on October 6, 2015, by Tor Books and is the second book in the Wax and Wayne series and fifth in the Mistborn series. It is preceded by The Alloy of Law in 2011 and followed by The Bands of Mourning in 2016.\n\n\n== Plot summary ==\nIn a flashback, Waxillium Ladrian first meets his future wife Lessie on a bounty hunt, where they work together to bag a powerful crime boss. In the present, it is one year since the defeat of the Vanishers. Wax and Marasi have learned of the art of Hemalurgy from the book given to them by Ironeyes. Wax has now been deputized by the city's constabulary.\nWhile hunting down a criminal called the Marksman with his partner Wayne, Wax sees the face of Bloody Tan (the man responsible for Lessie's death) in a crowd, but is unable to find him when he searches. Wax is called off the job and summoned by the constables to aid in a major investigation: the brother of Elendel's governor has been murdered at a meeting with a number of powerful crime bosses, who have all also been killed. This incident further stokes unrest over corruption and bad working conditions in the city. Wax finds evidence that only a Steelrunner (a Feruchemist who can store and utilize speed) could have committed the murders, but when he tracks down the only Steelrunner in the city, he finds her dead, murdered with a Hemalurgic spike.\nWax is approached by Harmony himself, who informs him that a rogue kandra named Paalm, now known as Bleeder, is responsible for the killings. She has gone mad, and ripped out one of her spikes to hide from Harmony. She has also found a way to grant herself metallic powers using Hemalurgy, though she can only hold one ability at a time. She now seeks unrest and destruction in the city, and is convinced that Harmony is a terrible, cruel god. Harmony promises to send supernatural help to Wax in order to foil her plots.\nWax and Marasi become convinced that governor Innate (whom Marasi has discovered is corrupt) will be the next target of Bleeder's attacks, and Wax finds evidence that Bleeder may have a personal vendetta against him. Bleeder finds a way to mentally communicate with Wax and draws him away from a noble party and into a trap laid by Set enforcers. Wax is saved by MeLaan, a kandra sent by Harmony to help him. Wax contacts his uncle Edwarn and attempts to strike a truce with the Set, but learns that the Set is backing Bleeder with both manpower and money. Bleeder kills a Survivorist priest while posing as a Pathian, which spurs riots in the city. Constable-general Aradel seeks permission to institute martial law.\nBleeder launches an attack on the governor's mansion, using her speed to slip by Wax and Wayne's defenses and to break into the governor's safe room; she only kills Innate's bodyguard before fleeing, however, and Wax guesses that she will not kill Innate until she can further destabilize the city. Innate gives permission for martial law, and insists on making a speech to quell the population. Bleeder leads Wax on another false chase alongside the famed kandra TenSoon, where they discover that she has made other Hemalurgic creations. Wax returns to the governor's mansion, and realizes that Bleeder has had time to prepare for many months, leading him to correctly guess that she has already killed and taken the place of the governor. Found out, she is forced to switch bodies and flee, Wax giving chase.\nWayne and Marasi have MeLaan impersonate the governor and give a speech to appease the populace. When even this does not seem to head off the rioters, Aradel publicly arrests the governor (MeLaan) on charges of corruption and installs himself as city leader. Wax pursues Bleeder to a bridge, where he discovers she is impersonating Lessie. He fires a specially crafted bullet with his hemalurgic earring forged inside it into her, allowing Harmony to assert his control. Rather than be controlled,",
        "metadata": {
            "title": "Mistborn: Shadows of Self",
            "summary": "Mistborn: Shadows of Self is a  fantasy novel written by American author Brandon Sanderson. It was published  on October 6, 2015, by Tor Books and is the second book in the Wax and Wayne series and fifth in the Mistborn series. It is preceded by The Alloy of Law in 2011 and followed by The Bands of Mourning in 2016.",
            "source": "https://en.wikipedia.org/wiki/Mistborn:_Shadows_of_Self",
            "cleaned": "Mistborn: Shadows of Self is a fantasy novel written by Brandon Sanderson. It was published on October 6, 2015, by Tor Books. It is the second book in the Wax and Wayne series and the fifth in the Mistborn series. The plot revolves around Waxillium Ladrian, who meets his future wife Lessie on a bounty hunt. In the present, Wax and Marasi investigate a series of murders committed by a rogue kandra named Bleeder. They discover Bleeder's plan to destabilize the city and eventually confront her. Wax defeats Bleeder by using a specially crafted bullet with a hemalurgic earring.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Mistborn: The Lost Metal is an urban fantasy novel written by American author Brandon Sanderson. It was published on November 15, 2022 by Tor Books. It is the fourth and final book in the Wax and Wayne series and seventh in the Mistborn series. It is preceded by The Bands of Mourning in 2016 and is to be followed by a new trilogy, written after release of fifth Stormlight Archive book and a novelization of the Cosmere graphic novel White Sand.\n\n\n== Plot summary ==\nSix years following The Bands of Mourning, Waxillium Ladrian has retired from his lawman career, and Wayne has become a full constable in Elendel law enforcement, serving under Marasi who has been promoted to detective. Wax, aided by his wife Steris (with whom he has two young children, Maxillium and Tindwyl), has become a prominent figure in Elendel politics, known as the 'Lawman Senator of the Roughs'. Since the discovery of the Southern Scadrials during the quest for the Bands of Mourning, diplomatic relations have been established with its most prominent nation, the Malwish Consortium. However, relations between the north and south remain tense, as do those between Elendel and its neighbouring cities in the Basin. Despite Wax's and Steris' efforts, conflict escalates.\nWax's sister Telsin, the leader of the Set, a terrorist group working for Trell (actually a Shard of Adonalsium called Autonomy), plots to smuggle a magical equivalent of an atomic bomb into Elendel. Marasi goes on a mission with a mysterious group known as the Ghostbloods, led by Kelsier, to stop Autonomy's forces from invading the world. Meanwhile, Wax and Wayne go to confront Telsin at the Set's base, killing several Set members, but discover that the bomb is not there, and instead is on a ship headed for the city. Marasi stops enemies in time and disables their portal, preventing the invasion, while Wax reaches the boat with Wayne. The duo discover that the bomb can be defused, but the defuser will die in the process. Wayne sacrifices himself to both defuse the bomb and save Wax. Telsin's overloaded body dies upon Autonomy removing her influence. \nIn the aftermath, Kelsier and Harmony debate about whether Harmony should introduce technology to the people or not, and Wax lives happily with Steris and his children. The city honors Wayne by putting up a statue of him.\n\n\n== Characters ==\nWaxillium \"Wax\" Ladrian: head of House Ladrian and a special constable and detective, Wax was once a lawman of the roughs and is now a senator. He is a Twinborn with the Allomantic ability to Push metals and the Feruchemical ability to increase or decrease his weight.\nWayne: Wax's best friend, who is a constable in Elendel law enforcement and has the Allomantic ability to make speed bubbles, in which time speeds up inside, and the Feruchemical ability to store health in goldminds to heal quickly, in exchange for a period of poor health.\nMarasi Colms: A constable who is Steris' illegitimate half-sister, who is a Pulser, an Allomancer that can slow down time within a bubble, and uses her ability via grenades that stop time when thrown.\nSteris Harms: Wax's wife, whom he has two children with. She is Marasi's half-sister.\nTelsin Ladrian: Wax's sister, the leader of the Set, a terrorist group, who has become the avatar of Autonomy.\nSazed / Harmony: A former Terrisman who ascended to become the god Harmony, who is in conflict with Autonomy.\nKelsier: The Mistborn Survivor of Hathsin who leads the Ghostbloods. He was killed by the Lord Ruler in The Final Empire, but managed to stay as a \"ghost\" (cognitive shadow) and later bound his spirit to a body.\nMarsh / Ironeyes / Death: Kelsier's Inquisitor brother, who has become a mythical figure associated with death. Ironically, his Atium stash is all but gone and without it his life would end.\n\n\n== Publication ==\nIn 2014, Sanderson revealed the tentative title of the fourth and final book of the Wax and Wayne series as The Lost Metal. It was initially planned to be released in 20",
        "metadata": {
            "title": "Mistborn: The Lost Metal",
            "summary": "Mistborn: The Lost Metal is an urban fantasy novel written by American author Brandon Sanderson. It was published on November 15, 2022 by Tor Books. It is the fourth and final book in the Wax and Wayne series and seventh in the Mistborn series. It is preceded by The Bands of Mourning in 2016 and is to be followed by a new trilogy, written after release of fifth Stormlight Archive book and a novelization of the Cosmere graphic novel White Sand.",
            "source": "https://en.wikipedia.org/wiki/Mistborn:_The_Lost_Metal",
            "cleaned": "- \"Mistborn: The Lost Metal\" is a novel written by Brandon Sanderson.\n- It was published on November 15, 2022, by Tor Books.\n- It is the fourth and final book in the Wax and Wayne series and the seventh in the Mistborn series.\n- The previous book in the series is \"The Bands of Mourning\" published in 2016.\n- After \"Mistborn: The Lost Metal,\" a new trilogy will be released, along with a novelization of the Cosmere graphic novel \"White Sand.\"\n- The plot follows Waxillium Ladrian, who has retired from his lawman career, and Wayne, who has become a constable in Elendel law enforcement.\n- Wax is involved in Elendel politics, while Wayne works with Marasi, who has been promoted to detective.\n- Tensions rise between different nations and cities, and conflict escalates despite Wax and Steris' efforts.\n- Wax's sister Telsin, leader of the Set, plans to smuggle a magical bomb into Elendel.\n- Marasi joins a group called the Ghostbloods to stop Autonomy's forces.\n- Wax and Wayne confront Telsin but discover the bomb is on a ship.\n- Marasi stops the enemies and disables their portal, while Wax and Wayne defuse the bomb.\n- Wayne sacrifices himself, and Telsin dies when Autonomy removes her influence.\n- In the aftermath, Kelsier and Harmony discuss introducing technology, and Wax lives happily with Steris and their children.\n- The city honors Wayne with a statue.\n- The main characters include Waxillium \"Wax\" Ladrian, Wayne, Marasi Colms, Steris Harms, Telsin Ladrian, Sazed/Harmony, Kelsier, and Marsh/Ironeyes/Death.\n- \"Mistborn: The Lost Metal\" was initially planned to be released in 2014.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "The Mistborn Adventure Game is a pen-and-paper role-playing game published in 2011 by Crafty Games. It is a licensed release based on American author Brandon Sanderson's Mistborn novel series.: 107  Sanderson was involved in the game's creation. The game's setting, Scadrial, is the same as that of the Mistborn series. The initial Mistborn Adventure Game book was released on December 16, 2011. Since 2011, four supplementary material books have been published. The first supplement was released March 2014 and is called Terris: Wrought of Copper. The second supplement was released on August 7, 2014 and is called Alloy of Law, not to be confused with the fourth Mistborn book called The Alloy of Law. The third supplement was released on December 22, 2015 and is called Skaa: Tin & Ash. The fourth supplement is called The Alloy of Law: Masks of the Past and was released on August 8, 2017.\n\n\n== Gameplay ==\nThe gameplay is largely built on narrative-based roleplay; however, active gameplay is based on rolling dice from a pool of 2–10 six-sided dice. The number of dice rolled is determined by a character's abilities. Conflict is resolved in a similar dice-rolling fashion.\n\n\n=== Character creation ===\nIndividual characters can be from the various social classes, such as Noble or Skaa, that exist in Scadrial. Although characters must conform to the setting to an extent, the backgrounds and personality of characters are largely created by the player's imagination with little constraint. Each character has different Attributes, Standings, Traits, and Powers that influence the active gameplay.\n\n\n== Published materials ==\nAll materials have been created and published by Crafty Games. In addition, all supplementary works include the title of the game itself which is also the name of the first book. The actual title of each supplement is printed beneath the game title. \n\n\n== Reception ==\nShannon Appelcline commented that, while the gameplay of the Mistborn Adventure Game is \"a big departure for Crafty\", the game was \"well-received and seems to have gotten more retail notice than most of Crafty's other releases to date, likely due to its strong license.\": 107 \n\n\n== External links ==\nProduct page on Crafty Games' website\nBrandon Sanderson's website\n\n\n== References ==",
        "metadata": {
            "title": "Mistborn Adventure Game",
            "summary": "The Mistborn Adventure Game is a pen-and-paper role-playing game published in 2011 by Crafty Games. It is a licensed release based on American author Brandon Sanderson's Mistborn novel series.: 107  Sanderson was involved in the game's creation. The game's setting, Scadrial, is the same as that of the Mistborn series. The initial Mistborn Adventure Game book was released on December 16, 2011. Since 2011, four supplementary material books have been published. The first supplement was released March 2014 and is called Terris: Wrought of Copper. The second supplement was released on August 7, 2014 and is called Alloy of Law, not to be confused with the fourth Mistborn book called The Alloy of Law. The third supplement was released on December 22, 2015 and is called Skaa: Tin & Ash. The fourth supplement is called The Alloy of Law: Masks of the Past and was released on August 8, 2017.",
            "source": "https://en.wikipedia.org/wiki/Mistborn_Adventure_Game",
            "cleaned": "The Mistborn Adventure Game is a pen-and-paper role-playing game published in 2011 by Crafty Games.\nIt is based on Brandon Sanderson's Mistborn novel series.\nSanderson was involved in the game's creation.\nThe game's setting is the same as that of the Mistborn series.\nThe initial Mistborn Adventure Game book was released on December 16, 2011.\nSince 2011, four supplementary material books have been published.\nThe first supplement, called Terris: Wrought of Copper, was released in March 2014.\nThe second supplement, called Alloy of Law, was released on August 7, 2014.\nThe third supplement, called Skaa: Tin & Ash, was released on December 22, 2015.\nThe fourth supplement, called The Alloy of Law: Masks of the Past, was released on August 8, 2017.\nThe gameplay is largely narrative-based roleplay with dice rolling.\nCharacter creation allows players to choose from various social classes in Scadrial.\nAll materials, including the supplements, have been created and published by Crafty Games.\nThe Mistborn Adventure Game received positive reception and gained retail notice.\nExternal links: Product page on Crafty Games' website, Brandon Sanderson's website.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Brandon Winn Sanderson (born December 19, 1975) is an American author of high fantasy and science fiction. He is best known for the Cosmere fictional universe, in which most of his fantasy novels, most notably the Mistborn series and The Stormlight Archive, are set. Outside of the Cosmere, he has written several young adult and juvenile series including The Reckoners, the Skyward series, and the Alcatraz series. He is also known for finishing Robert Jordan's high fantasy series The Wheel of Time. Sanderson has created several graphic novel fantasy series, including White Sand and Dark One.\nHe created Sanderson's Laws of Magic and popularized the idea of \"hard magic\" and \"soft magic\" systems. In 2008, Sanderson started a podcast with author Dan Wells and cartoonist Howard Tayler called Writing Excuses, involving topics about creating genre writing and webcomics. In 2016, the American media company DMG Entertainment licensed the movie rights to Sanderson's entire Cosmere universe, but the rights have since reverted back to Sanderson. Sanderson's March 2022 Kickstarter campaign became the most successful in history, finishing with 185,341 backers pledging $41,754,153.\n\n\n== Personal life ==\n\n\n=== Early life and education ===\nBrandon Winn Sanderson was born on December 19, 1975, in Lincoln, Nebraska, the eldest of four children. Sanderson was a \"reluctant reader\" as a child, but became passionate for the medium after being given a copy of Dragonsbane by Barbara Hambly when he was 14. He made several early attempts at writing his own stories. After graduating from high school in 1994, he went to Brigham Young University (BYU) as a biochemistry major. He took a two-year leave of absence from 1995 to 1997 to serve as a volunteer missionary for the Church of Jesus Christ of Latter-day Saints and was assigned to serve in South Korea.After completing his missionary service, Sanderson returned to BYU and changed his major to English literature. While an undergraduate, Sanderson took a job as a night auditor at a local hotel in Provo, Utah, as it allowed him to write while working. One of Sanderson's roommates at BYU was Ken Jennings, who nearly ten years later became famous during his 74-game win streak on the American game show Jeopardy!. Sanderson graduated from BYU in 2000 with a Bachelor of Arts. He continued on as a graduate student, receiving an M.A. in English with an emphasis in creative writing in 2004. While at BYU, Sanderson was on the staff of Leading Edge, a semi-professional speculative fiction magazine published by the university, and served as its editor-in-chief for one year.In 2006, Sanderson married Emily Bushman, an English, Spanish, and ESL teacher and fellow BYU alumna who later became his business manager. They have three sons and reside in American Fork, Utah.\n\n\n== Career ==\n\n\n=== Early writing career ===\nSanderson wrote consistently throughout his undergraduate and graduate studies; by 2003, he had written twelve novels, though no publisher had accepted any of them for publication. While in the middle of a graduate program at BYU, he was contacted by Tor Books editor Moshe Feder, who wanted to acquire one of his books. Sanderson had submitted the manuscript of his sixth novel, Elantris, a year and a half earlier. Elantris was published by Tor Books on April 21, 2005, to generally positive reviews. This was followed in 2006 by Mistborn: The Final Empire, the first book in his Mistborn fantasy trilogy, in which \"allomancers\"—people with the ability to 'burn' metals and alloys after ingesting them—gain enhanced senses and control over powerful supernatural forces.He published the second book of the Mistborn series The Well of Ascension in 2007. Later that year, Sanderson published the children's novel Alcatraz Versus the Evil Librarians, about a boy named Alcatraz with a talent for breaking things. Alcatraz confronts a group of evil librarians who are bent on taking over the world. The first of his \"laws of magic\" we",
        "metadata": {
            "title": "Brandon Sanderson",
            "summary": "Brandon Winn Sanderson (born December 19, 1975) is an American author of high fantasy and science fiction. He is best known for the Cosmere fictional universe, in which most of his fantasy novels, most notably the Mistborn series and The Stormlight Archive, are set. Outside of the Cosmere, he has written several young adult and juvenile series including The Reckoners, the Skyward series, and the Alcatraz series. He is also known for finishing Robert Jordan's high fantasy series The Wheel of Time. Sanderson has created several graphic novel fantasy series, including White Sand and Dark One.\nHe created Sanderson's Laws of Magic and popularized the idea of \"hard magic\" and \"soft magic\" systems. In 2008, Sanderson started a podcast with author Dan Wells and cartoonist Howard Tayler called Writing Excuses, involving topics about creating genre writing and webcomics. In 2016, the American media company DMG Entertainment licensed the movie rights to Sanderson's entire Cosmere universe, but the rights have since reverted back to Sanderson. Sanderson's March 2022 Kickstarter campaign became the most successful in history, finishing with 185,341 backers pledging $41,754,153.",
            "source": "https://en.wikipedia.org/wiki/Brandon_Sanderson",
            "cleaned": "Brandon Winn Sanderson is an American author of high fantasy and science fiction. He is known for the Cosmere fictional universe, Mistborn series, The Stormlight Archive, and other series. Sanderson finished Robert Jordan's The Wheel of Time series. He created Sanderson's Laws of Magic and popularized \"hard magic\" and \"soft magic\" systems. Sanderson started the podcast Writing Excuses with Dan Wells and Howard Tayler. In 2016, DMG Entertainment licensed the movie rights to Sanderson's Cosmere universe. Sanderson's March 2022 Kickstarter campaign was the most successful in history. Sanderson was born on December 19, 1975, in Lincoln, Nebraska. He attended Brigham Young University (BYU) and graduated with a Bachelor of Arts in 2000. Sanderson married Emily Bushman and they have three sons. Sanderson's first published novel was Elantris in 2005. He also wrote the Mistborn series and Alcatraz Versus the Evil Librarians.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Michael Kramer is an American audiobook narrator. Kramer has recorded over a hundred audiobooks for trade publishers and has participated in the Library of Congress's Talking Books program.\n\n\n== Reception and awards ==\nKramer has received praise for his narrations, with the Library Journal stating that Kramer reads \"clearly and intensely\".\n\n\n=== Awards ===\nAudioFile Earphones Award\nTorgi Award\n\n\n== Personal life ==\nKramer lives in Washington, D.C. area with his wife, Jennifer Mendenhall (aka Kate Reading), and their two children. Kramer and Reading have co-narrated audiobooks. Kramer also works as an actor in the local theater, including The Kennedy Center’s production of The Light of Excalibur.\n\n\n== Bibliography ==\n\n\n=== As narrator ===\n\n\n== References ==\n\n\n== External links ==\nAuthor profile on AudioFile",
        "metadata": {
            "title": "Michael Kramer (narrator)",
            "summary": "Michael Kramer is an American audiobook narrator. Kramer has recorded over a hundred audiobooks for trade publishers and has participated in the Library of Congress's Talking Books program.",
            "source": "https://en.wikipedia.org/wiki/Michael_Kramer_(narrator)",
            "cleaned": "Michael Kramer is an American audiobook narrator.\nKramer has recorded over a hundred audiobooks for trade publishers and has participated in the Library of Congress's Talking Books program.\nKramer has received praise for his narrations, with the Library Journal stating that Kramer reads \"clearly and intensely\".\nKramer lives in Washington, D.C. area with his wife, Jennifer Mendenhall (aka Kate Reading), and their two children.\nKramer and Reading have co-narrated audiobooks.\nKramer also works as an actor in the local theater, including The Kennedy Center’s production of The Light of Excalibur.\nAuthor profile on AudioFile.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Arcanum Unbounded: The Cosmere Collection is a collection of epic fantasy short stories and novellas written by American author Brandon Sanderson set in his Cosmere universe. It was published on November 22, 2016 by Tor Books.\n\n\n== Contents ==\nThe nine stories in the collection are set in the worlds of Roshar, Scadrial, Sel, Threnody, First of the Sun, and Taldain, which are all a part of Sanderson's Cosmere universe. The collection also includes essays and illustrations for the various planetary systems in which the stories are set. All have been released individually or as part of multi-author anthologies in the past.\nThe collection includes the following works:\n\nThe Emperor's Soul, a novella originally published in 2012\nThe Hope of Elantris, originally published as an e-book in 2007\nThe Eleventh Metal, originally released in 2011 as part of the Mistborn Adventure Game\nAllomancer Jak and the Pits of Eltania, Episodes 28 through 30, originally released on August 3, 2014 as part of the Alloy of Law extension to the Mistborn Adventure Game\nMistborn: Secret History, a short novel originally published in 2016 as an e-book\nWhite Sand, an excerpt of the graphic novel originally published in 2016 and a previously unpublished opening section of the original prose version of the story.\nShadows for Silence in the Forests of Hell, a novella originally published in 2013 in the Dangerous Women anthology\nSixth of the Dusk, a novellette originally published in 2014 in the Shadows Beneath anthology\nEdgedancer, a Stormlight Archive novella\n\n\n== Reception ==\nPublishers Weekly called the collection required reading for fans of Sanderson's work and noted that it also offers a lot to readers who are undaunted by learning a lot. Kirkus Reviews wrote that many of the stories were \"good...with all the quick wit, richly detailed settings, and memorable characters fans have come to expect from this prolific writer.\" However, they also stated that some of the stories lacked solid character building and felt \"more like deleted scenes\".\n\n\n== References ==\n\n\n== External links ==\nArcanum Unbounded: The Cosmere Collection title listing at the Internet Speculative Fiction Database",
        "metadata": {
            "title": "Arcanum Unbounded: The Cosmere Collection",
            "summary": "Arcanum Unbounded: The Cosmere Collection is a collection of epic fantasy short stories and novellas written by American author Brandon Sanderson set in his Cosmere universe. It was published on November 22, 2016 by Tor Books.",
            "source": "https://en.wikipedia.org/wiki/Arcanum_Unbounded:_The_Cosmere_Collection",
            "cleaned": "Arcanum Unbounded: The Cosmere Collection is a collection of epic fantasy short stories and novellas written by Brandon Sanderson set in his Cosmere universe.\nIt was published on November 22, 2016 by Tor Books.\nThe nine stories in the collection are set in the worlds of Roshar, Scadrial, Sel, Threnody, First of the Sun, and Taldain, which are all a part of Sanderson's Cosmere universe.\nThe collection also includes essays and illustrations for the various planetary systems in which the stories are set.\nThe collection includes several works such as \"The Emperor's Soul\", \"The Hope of Elantris\", \"The Eleventh Metal\", \"Allomancer Jak and the Pits of Eltania\", \"Mistborn: Secret History\", \"White Sand\", \"Shadows for Silence in the Forests of Hell\", \"Sixth of the Dusk\", and \"Edgedancer\".\nPublishers Weekly called the collection required reading for fans of Sanderson's work and noted that it also offers a lot to readers who are undaunted by learning a lot.\nKirkus Reviews wrote that many of the stories were good with all the quick wit, richly detailed settings, and memorable characters fans have come to expect from this prolific writer.\nHowever, they also stated that some of the stories lacked solid character building and felt more like deleted scenes.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "This is the bibliography of American fantasy and science fiction writer Brandon Sanderson.\n\n\n== Cosmere ==\nMany of Sanderson's works are set on different planets in an overarching universe known as the Cosmere. They are often subtly connected, with some characters appearing across the various series.\n\n\n=== Novels ===\n\n\n=== Short works ===\n\n\n=== Graphic novels ===\n\n\n== Alcatraz ==\nHumorous fantasy adventure series for children.\n\n\n== Cytoverse ==\nYoung adult science fiction series.\n\n\n== The Wheel of Time ==\nSanderson was selected to continue Robert Jordan's fantasy series The Wheel of Time, after Jordan's death, by his editor and widow Harriet McDougal.\n\n\n== Legion ==\nThe Legion novellas are science fiction and center around Stephen Leeds as he investigates different mystery cases.\n\n\n== The Reckoners ==\nYoung adult superhero adventure series.\n\n\n== Other works ==\n\n\n== References ==\n\n\n=== Print sources ===\nFuller, Amy Elizabeth, ed. (2016). Contemporary authors new revision series. Volume 300 : a bio-bibliographical guide to current writers in fiction, general nonfiction, poetry, journalism, drama, motion pictures, television, and other fields. Gale. ISBN 978-1414419244.",
        "metadata": {
            "title": "Brandon Sanderson bibliography",
            "summary": "This is the bibliography of American fantasy and science fiction writer Brandon Sanderson.",
            "source": "https://en.wikipedia.org/wiki/Brandon_Sanderson_bibliography",
            "cleaned": "Brandon Sanderson is an American fantasy and science fiction writer. He has created an overarching universe known as the Cosmere, where many of his works are set on different planets. The Cosmere series are subtly connected, with some characters appearing across the various series. Sanderson has written novels, short works, and graphic novels. He has also written the Alcatraz series, a humorous fantasy adventure for children, and the Cytoverse series, a young adult science fiction series. Sanderson was chosen to continue Robert Jordan's fantasy series, The Wheel of Time, after Jordan's death. He has also written the Legion novellas, which are science fiction stories centered around Stephen Leeds investigating different mystery cases. Sanderson's other works include The Reckoners, a young adult superhero adventure series. References can be found in print sources such as the Contemporary Authors New Revision Series.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "The Stormlight Archive is a series of epic fantasy novels written by American author Brandon Sanderson, planned to consist of ten novels. As of 2023, the series comprises four published novels and two novellas, set within his broader Cosmere universe. The first novel, The Way of Kings, was published on August 31, 2010. The second novel, Words of Radiance, was published in 2014 and debuted at number one on The New York Times Best Seller List, followed by Oathbringer in 2017 and Rhythm of War in 2020. A fifth novel, tentatively named Wind and Truth, is expected to be released December 7th 2024, while writing for the latter half of the series will begin after Sanderson finishes writing the upcoming Era Three Mistborn trilogy and the two Elantris sequels.\n\n\n== Publication history ==\nSanderson completed the first draft of The Way of Kings in 2003, though the original manuscript differed significantly from the published text. Sanderson referred to the prospective series as The Oathshards Series in 2004. The first draft of the manuscript was among over a dozen books written before his debut publication Elantris (2005). The book was substantially rewritten between then and its 2010 publication. Six chapters of this early version were included in the anthology Altered Perceptions (2014). The original version of the book is available on the author's official website.From June to August 2010, Tor Books published sample chapters from The Way of Kings on its official website, along with an introduction by Sanderson. In its first week of release, The Way of Kings was No. 7 on The New York Times Best Seller list. In subsequent weeks the book was No. 11, No. 20, and No. 25.In October 2010, Brandon Sanderson revealed that his tentative plan was to release the second book in the series in 2012, approximately two years after the release of the first book, due to writing the final book of The Wheel of Time, followed by the third book about a year later. However, after completing the first draft of A Memory of Light, Sanderson revealed the book would be pushed back to a 2014 release, almost four years after the first book. The second book was initially titled Highprince of War (referring to Highprince Dalinar), but Sanderson decided to focus the second book on Shallan, tentatively titling it The Book of Endless Pages and eventually settling on Words of Radiance with Highprince Dalinar's book as the third novel, titled Oathbringer.The first draft of the fourth book was completed in December 2019. The title, Rhythm of War, was announced on the Tor website on February 10, 2020. The cover was revealed six months later, on August 17. The book was finished in July 2020. In a Facebook post, the author revealed that the final word count is \"roughly 460,000\" words, around the length of Oathbringer, and the book consists of 112 chapters, plus differently numbered interludes, a prologue, and an epilogue. Rhythm of War was published on November 17, 2020.\n\n\n== Books ==\nTen books are planned in the series, broken down into two sets of five books each. Sanderson describes the planned story arc of the second set of five books as a \"sequel\" to the first set, with some appearances of characters from the first set. The biggest timeskip in the series will occur between the fifth and sixth book.As of 2020, two novellas have been published. The first novella, titled Edgedancer and featuring the character Lift, is set between Words of Radiance and Oathbringer and was originally published in Arcanum Unbounded: The Cosmere Collection in 2016. A standalone edition of Edgedancer was published on October 17, 2017. The second novella, Dawnshard, featuring the characters Rysn and Lopen, was published in November 2020 and takes place in the one-year gap between Oathbringer and Rhythm of War.\n\n\n== Setting ==\n\n\n=== World ===\nRoshar is the native name for the planet on which The Stormlight Archive is set. It is also the name of the supercontinent on which the main events of the se",
        "metadata": {
            "title": "The Stormlight Archive",
            "summary": "The Stormlight Archive is a series of epic fantasy novels written by American author Brandon Sanderson, planned to consist of ten novels. As of 2023, the series comprises four published novels and two novellas, set within his broader Cosmere universe. The first novel, The Way of Kings, was published on August 31, 2010. The second novel, Words of Radiance, was published in 2014 and debuted at number one on The New York Times Best Seller List, followed by Oathbringer in 2017 and Rhythm of War in 2020. A fifth novel, tentatively named Wind and Truth, is expected to be released December 7th 2024, while writing for the latter half of the series will begin after Sanderson finishes writing the upcoming Era Three Mistborn trilogy and the two Elantris sequels.\n\n",
            "source": "https://en.wikipedia.org/wiki/The_Stormlight_Archive",
            "cleaned": "The Stormlight Archive is a series of epic fantasy novels written by Brandon Sanderson.\nThe series is planned to consist of ten novels.\nAs of 2023, there are four published novels and two novellas in the series.\nThe first novel, The Way of Kings, was published on August 31, 2010.\nThe second novel, Words of Radiance, was published in 2014 and debuted at number one on The New York Times Best Seller List.\nThe third novel, Oathbringer, was published in 2017.\nThe fourth novel, Rhythm of War, was published in 2020.\nA fifth novel, tentatively named Wind and Truth, is expected to be released on December 7, 2024.\nThe series is set within Brandon Sanderson's broader Cosmere universe.\nSanderson completed the first draft of The Way of Kings in 2003.\nThe original manuscript differed significantly from the published text.\nThe book was substantially rewritten between then and its 2010 publication.\nThe second book in the series was initially titled Highprince of War, but the focus shifted to Shallan and it was eventually titled Words of Radiance.\nThe first draft of the fourth book, Rhythm of War, was completed in December 2019.\nThe book was finished in July 2020 and published on November 17, 2020.\nTen books are planned in the series, divided into two sets of five books each.\nThe second set of five books is a sequel to the first set and features some characters from the first set.\nTwo novellas have been published in the series.\nThe first novella, Edgedancer, is set between Words of Radiance and Oathbringer.\nThe second novella, Dawnshard, takes place in the one-year gap between Oathbringer and Rhythm of War.\nThe series is set on the planet Roshar.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "James Oliver Rigney Jr. (October 17, 1948 – September 16, 2007), better known by his pen name Robert Jordan, was an American author of epic fantasy. He is known best for his series  The Wheel of Time (finished by Brandon Sanderson after Jordan's death) which comprises 14 books and a prequel novel. He is one of several writers to have written original Conan the Barbarian novels; his are considered by fans to be some of the best of the non-Robert E. Howard efforts. Jordan also published historical fiction using the pseudonym Reagan O'Neal, a western as Jackson O'Reilly, and dance criticism as Chang Lung. Jordan claimed to have ghostwritten an \"international thriller\" that is still believed to have been written by someone else.\n\n\n== Early life ==\nJordan was born in Charleston, South Carolina. He went to Clemson University after high school, but dropped out after one year and enlisted in the U.S. Army. He served two tours of duty during the Vietnam War as a helicopter gunner. He was awarded the Distinguished Flying Cross with oak leaf cluster, the Bronze Star with \"V\" and oak leaf cluster, and two Vietnamese Gallantry Crosses with palm.After returning from Vietnam in 1970, Jordan studied physics at The Citadel. He graduated in 1974 with a Bachelor of Science degree and began working for the U.S. Navy as a nuclear engineer. He began writing in 1977.\n\n\n== Personal life ==\nRobert Jordan was a history buff and enjoyed hunting, fishing, sailing, poker, chess, pool, and pipe-collecting. He described himself as a \"High church\" Episcopalian and received communion more than once a week. Politically, he described himself as a \"libertarian monarchist\". He lived with his wife, Harriet McDougal, who works as a book editor (currently with Tor Books; she was also Jordan's editor) in a house built in 1797. He listed John D. MacDonald, Jane Austen, Louis L'Amour, Charles Dickens, Robert A. Heinlein, Mark Twain and Montaigne as his favorite authors.\n\n\n=== Illness and death ===\nOn March 23, 2006, Jordan revealed that he had been diagnosed with cardiac amyloidosis and that, with treatment, his median life expectancy was four years. In a separate weblog post, he encouraged his fans not to worry about him and stated that he intended to have a long and creative life.He began chemotherapy at Mayo Clinic during early April 2006. He participated in a study of the drug Revlimid, which had been approved recently for multiple myeloma but not yet tested for primary amyloidosis.Jordan died on September 16, 2007, from complications stemming from multiple myeloma. His funeral service was on September 19, 2007. He was cremated and his ashes buried in the churchyard of St. James Church in Goose Creek, outside Charleston, South Carolina.Jordan's papers can be found in the special collections of the College of Charleston.\n\n\n== Selected works ==\n\n\n=== The Wheel of Time ===\n\nJordan published 11 books of 14 in the main sequence of the Wheel of Time series. Reviewers and fans of the earlier books noted a slowing of the pace of events in the last few installments written solely by Jordan owing to the expansion of the scale of the series as a whole. Because of his health problems, Jordan did not work at full force on the final installment A Memory of Light (later split into three volumes beginning with The Gathering Storm), but blog entries confirmed that he continued work on it until his death, and he shared all of the significant plot details with his family not long before he died. He maintained that in doing so the book would get published even if \"the worst actually happens\". On December 7, 2007, Tor Books announced that Brandon Sanderson had been chosen to finish the Wheel of Time series. Harriet McDougal, Jordan's widow, chose him after reading Mistborn: The Final Empire.\nAll paperback (PB) page totals given are for the most widely available mass-market paperback editions. The page count for the hardback (HB) editions does not include glossary or appendix page count",
        "metadata": {
            "title": "Robert Jordan",
            "summary": "James Oliver Rigney Jr. (October 17, 1948 – September 16, 2007), better known by his pen name Robert Jordan, was an American author of epic fantasy. He is known best for his series  The Wheel of Time (finished by Brandon Sanderson after Jordan's death) which comprises 14 books and a prequel novel. He is one of several writers to have written original Conan the Barbarian novels; his are considered by fans to be some of the best of the non-Robert E. Howard efforts. Jordan also published historical fiction using the pseudonym Reagan O'Neal, a western as Jackson O'Reilly, and dance criticism as Chang Lung. Jordan claimed to have ghostwritten an \"international thriller\" that is still believed to have been written by someone else.",
            "source": "https://en.wikipedia.org/wiki/Robert_Jordan",
            "cleaned": "James Oliver Rigney Jr. was an American author of epic fantasy, known as Robert Jordan. He is famous for his series \"The Wheel of Time\" which consists of 14 books and a prequel novel. He also wrote Conan the Barbarian novels and published historical fiction, a western, and dance criticism under different pseudonyms. Jordan was born in Charleston, South Carolina, and served in the U.S. Army during the Vietnam War. He studied physics at The Citadel and worked as a nuclear engineer for the U.S. Navy. Jordan was married to Harriet McDougal, a book editor. He passed away on September 16, 2007, due to complications from multiple myeloma. Jordan's papers can be found in the special collections of the College of Charleston. He published 11 books of \"The Wheel of Time\" series and Brandon Sanderson finished the series after Jordan's death.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Hard fantasy is a term used to describe different types of fantasy literature, especially those which present stories set in (and often centered on) a rational and knowable world. In this sense, the term is analogous to hard science fiction, from which it draws its name, in that both build their respective worlds in a rigorous and logical manner. However, the term has other uses, and the scholar Misha Grifka-Wander has argued that it is both unpopular and inaccurate.\n\n\n== Definition ==\nIn The Encyclopedia of Fantasy (1997), Gary Westfahl defined hard fantasy as a term for stories in which \"magic is regarded as an almost scientific force of nature and subject to the same sort of rules and principles\", and which \"might refer to fantasy stories equivalent to the form of hard sf known as the 'scientific problem' story, where the hero must logically solve a problematic magical situation\". He noted that John W. Campbell promoted this kind of fantasy when he was editor of Unknown.  In The A to Z of Fantasy Literature, Brian Stableford described this as \"probably the most useful application\" of the term.Another example of this type of hard fantasy is Brandon Sanderson's spectrum of hard and soft magic systems. Sanderson describes magic which does not follow strict rules but preserves a sense of wonder as \"soft\", whilst \"hard magic\" has rules which the author explicitly describes. Emily Strand has described this as influenced by Orson Scott Card and Arthur C. Clarke's Third Law.\n\n\n=== Examples ===\nExamples of works described as hard fantasy in this sense include:\n\n\"Trouble with Water\" (1939) by H. L. Gold\nMagic, Inc. (1941) by Robert A Heinlein\nLord Darcy series (1964–1979) by Randall Garrett\nMaster of the Five Magics (1980) by Lyndon Hardy\nDragon Cauldron (1991) by Laurence Yep\nMistborn (2006–2022) by Brandon Sanderson\n\n\n== Other uses ==\nStableford stated that the term \"is used in several different ways\", and was originally used by historical fantasy writers in the late 1980s to describe works that were \"scrupulously faithful to historical and anthropological data\" outside having some magical or mythic plot elements. He names Christian Jacq as an example.Michael Swanwick's essay \"In the Tradition\", subtitled \"A Cruise through the Hard Fantasy Archipelago...\" uses the term to discuss the possibility of major fantasy works providing a structure for the genre, as hard science fiction does for science fiction in general, and concludes that it is impossible.Fernando Savater has contrasted \"hard\" fantasy with \"soft\" fantasy. He describes \"soft fantasy\" as \"unstructured\" and \"amorphous\", such as Alice in Wonderland and The Dream-Quest of Unknown Kadath. Hard fantasy, on the other hand, obeys and extrapolates from rules; Savater cites the works of Jules Verne, H. G. Wells, Olaf Stapledon, and Rendezvous with Rama as examples.In the introduction to the anthology Modern Masters of Fantasy, editor Gardner Dozois mentioned a subgenre called \"Hard Fantasy\" as a \"vaguely defined hybrid between Tolkienesque fantasy, technologically oriented \"hard\" science fiction, and steampunk\". Dozois' examples included The Iron Dragon's Daughter by Michael Swanwick, Metropolitan by Walter John Williams, and \"The Giving Mouth\" by Ian R. MacLeod.The term has also been used to describe fantasy writing with accurate research.\n\n\n== See also ==\nHard science fiction\nScience fantasy\nSoft science fiction\nTechnofantasy\nUnknown—a pulp magazine dedicated to hard-type fantasy\n\n\n== References ==",
        "metadata": {
            "title": "Hard fantasy",
            "summary": "Hard fantasy is a term used to describe different types of fantasy literature, especially those which present stories set in (and often centered on) a rational and knowable world. In this sense, the term is analogous to hard science fiction, from which it draws its name, in that both build their respective worlds in a rigorous and logical manner. However, the term has other uses, and the scholar Misha Grifka-Wander has argued that it is both unpopular and inaccurate.",
            "source": "https://en.wikipedia.org/wiki/Hard_fantasy",
            "cleaned": "Hard fantasy is a term used to describe different types of fantasy literature, especially those set in a rational and knowable world.\nThe term is analogous to hard science fiction, as both build their worlds in a rigorous and logical manner.\nMisha Grifka-Wander argues that the term is unpopular and inaccurate.\nGary Westfahl defines hard fantasy as stories where magic follows rules and principles, similar to hard science fiction.\nJohn W. Campbell promoted this type of fantasy when he was editor of Unknown.\nBrian Stableford describes it as the most useful application of the term.\nBrandon Sanderson's spectrum of hard and soft magic systems is an example of hard fantasy.\nExamples of hard fantasy works include \"Trouble with Water\" by H. L. Gold, \"Magic, Inc.\" by Robert A Heinlein, Lord Darcy series by Randall Garrett, \"Master of the Five Magics\" by Lyndon Hardy, \"Dragon Cauldron\" by Laurence Yep, and \"Mistborn\" by Brandon Sanderson.\nThe term has other uses, including describing works that are faithful to historical and anthropological data with magical or mythic elements.\nMichael Swanwick discusses the possibility of major fantasy works providing a structure for the genre, similar to hard science fiction.\nFernando Savater contrasts hard fantasy with soft fantasy, describing soft fantasy as unstructured and amorphous.\nGardner Dozois mentions a subgenre called \"Hard Fantasy\" that combines Tolkienesque fantasy, technologically oriented \"hard\" science fiction, and steampunk.\nThe term has also been used to describe fantasy writing with accurate research.\nSee also: Hard science fiction, Science fantasy, Soft science fiction, Technofantasy, Unknown (a pulp magazine dedicated to hard-type fantasy).",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and usually inspired by mythology or folklore. The term \"fantasy\" can also be used to describe a \"work of this genre\", usually literary.\nIts roots are in oral traditions, which became fantasy literature and drama. From the twentieth century, it has expanded further into various media, including film, television, graphic novels, manga, animations and video games.\nThe expression fantastic literature is also often used to refer to this genre by the Anglophone literary critics. An alternate term for the genre is phantasy, although this is rarely used.\nFantasy is distinguished from the genres of science fiction and horror by the absence of scientific or macabre themes, although these can occur in fantasy. In popular culture, the fantasy genre predominantly features settings that emulate Earth, but with a sense of otherness. In its broadest sense, however, fantasy consists of works by many writers, artists, filmmakers, and musicians from ancient myths and legends to many recent and popular works.\n\n\n== Traits ==\nMost fantasy uses magic or other supernatural elements as a main plot element, theme, or setting. Magic, magic practitioners (sorcerers, witches and so on) and magical creatures are common in many of these worlds.An identifying trait of fantasy is the author's use of narrative elements that do not have to rely on history or nature to be coherent. This differs from realistic fiction in that realistic fiction has to attend to the history and natural laws of reality, where fantasy does not. In writing fantasy the author uses worldbuilding to create characters, situations, and settings that may not be possible in reality.\nMany fantasy authors use real-world folklore and mythology as inspiration; and although another defining characteristic of the fantasy genre is the inclusion of supernatural elements, such as magic, this does not have to be the case.\nFantasy has often been compared to science fiction and horror because they are the major categories of speculative fiction. Fantasy is distinguished from science fiction by the plausibility of the narrative elements. A science fiction narrative is unlikely, though seemingly possible through logical scientific or technological extrapolation, where fantasy narratives do not need to be scientifically possible. Authors have to rely on the readers' suspension of disbelief, an acceptance of the unbelievable or impossible for the sake of enjoyment, in order to write effective fantasies. Despite both genres' heavy reliance on the supernatural, fantasy and horror are distinguishable from one another. Horror primarily evokes fear through the protagonists' weaknesses or inability to deal with the antagonists.\n\n\n== History ==\n\n\n=== Early history ===\n\nElements of the supernatural and the fantastic were a part of literature from its beginning. Fantasy elements occur throughout ancient religious texts such as the Epic of Gilgamesh. The ancient Babylonian creation epic, the Enûma Eliš, in which the god Marduk slays the goddess Tiamat, contains the theme of a cosmic battle between good and evil, which is characteristic of the modern fantasy genre. Genres of romantic and fantasy literature existed in ancient Egypt. The Tales of the Court of King Khufu, which is preserved in the Westcar Papyrus and was probably written in the middle of the second half of the eighteenth century BC, preserves a mixture of stories with elements of historical fiction, fantasy, and satire. Egyptian funerary texts preserve mythological tales, the most significant of which are the myths of Osiris and his son Horus.Myth with fantastic elements intended for adults were a major genre of ancient Greek literature. The comedies of Aristophanes are filled with fantastic elements, particularly his play The Birds, in which an Athenian man builds a city in the clouds with the birds and challenges Zeus's authority. Ovid's Metamor",
        "metadata": {
            "title": "Fantasy",
            "summary": "Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and usually inspired by mythology or folklore. The term \"fantasy\" can also be used to describe a \"work of this genre\", usually literary.\nIts roots are in oral traditions, which became fantasy literature and drama. From the twentieth century, it has expanded further into various media, including film, television, graphic novels, manga, animations and video games.\nThe expression fantastic literature is also often used to refer to this genre by the Anglophone literary critics. An alternate term for the genre is phantasy, although this is rarely used.\nFantasy is distinguished from the genres of science fiction and horror by the absence of scientific or macabre themes, although these can occur in fantasy. In popular culture, the fantasy genre predominantly features settings that emulate Earth, but with a sense of otherness. In its broadest sense, however, fantasy consists of works by many writers, artists, filmmakers, and musicians from ancient myths and legends to many recent and popular works.",
            "source": "https://en.wikipedia.org/wiki/Fantasy",
            "cleaned": "Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and usually inspired by mythology or folklore.\nThe term \"fantasy\" can also be used to describe a \"work of this genre\", usually literary.\nIts roots are in oral traditions, which became fantasy literature and drama.\nFrom the twentieth century, it has expanded further into various media, including film, television, graphic novels, manga, animations, and video games.\nThe expression fantastic literature is also often used to refer to this genre by the Anglophone literary critics.\nAn alternate term for the genre is phantasy, although this is rarely used.\nFantasy is distinguished from the genres of science fiction and horror by the absence of scientific or macabre themes, although these can occur in fantasy.\nIn popular culture, the fantasy genre predominantly features settings that emulate Earth, but with a sense of otherness.\nIn its broadest sense, however, fantasy consists of works by many writers, artists, filmmakers, and musicians from ancient myths and legends to many recent and popular works.\nMost fantasy uses magic or other supernatural elements as a main plot element, theme, or setting.\nMagic, magic practitioners (sorcerers, witches and so on), and magical creatures are common in many of these worlds.\nAn identifying trait of fantasy is the author's use of narrative elements that do not have to rely on history or nature to be coherent.\nThis differs from realistic fiction in that realistic fiction has to attend to the history and natural laws of reality, where fantasy does not.\nIn writing fantasy the author uses worldbuilding to create characters, situations, and settings that may not be possible in reality.\nMany fantasy authors use real-world folklore and mythology as inspiration.\nAlthough another defining characteristic of the fantasy genre is the inclusion of supernatural elements, such as magic, this does not have to be the case.\nFantasy has often been compared to science fiction and horror because they are the major categories of speculative fiction.\nFantasy is distinguished from science fiction by the plausibility of the narrative elements.\nA science fiction narrative is unlikely, though seemingly possible through logical scientific or technological extrapolation, where fantasy narratives do not need to be scientifically possible.\nAuthors have to rely on the readers' suspension of disbelief, an acceptance of the unbelievable or impossible for the sake of enjoyment, in order to write effective fantasies.\nDespite both genres' heavy reliance on the supernatural, fantasy and horror are distinguishable from one another.\nHorror primarily evokes fear through the protagonists' weaknesses or inability to deal with the antagonists.\nElements of the supernatural and the fantastic were a part of literature from its beginning.\nFantasy elements occur throughout ancient religious texts such as the Epic of Gilgamesh.\nThe ancient Babylonian creation epic, the Enûma Eliš, in which the god Marduk slays the goddess Tiamat, contains the theme of a cosmic battle between good and evil, which is characteristic of the modern fantasy genre.\nGenres of romantic and fantasy literature existed in ancient Egypt.\nThe Tales of the Court of King Khufu, which is preserved in the Westcar Papyrus and was probably written in the middle of the second half of the eighteenth century BC, preserves a mixture of stories with elements of historical fiction, fantasy, and satire.\nEgyptian funerary texts preserve mythological tales, the most significant of which are the myths of Osiris and his son Horus.\nMyth with fantastic elements intended for adults were a major genre of ancient Greek literature.\nThe comedies of Aristophanes are filled with fantastic elements, particularly his play The Birds, in which an Athenian man builds a city in the clouds with the birds and challenges Zeus's authority.\nOvid's Metamorphoses contains numerous episodes of fantastic transformations.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Elantris is a fantasy novel written by American fantasy and science fiction writer Brandon Sanderson. The book was published on April 21, 2005, by Tor Books and was Sanderson's first published book. The book gained generally positive reviews, and has been translated into multiple languages. Two related works, Hope of Elantris and The Emperor's Soul, have been released, and two additional novels in the series have been announced.\nThe story follows three main characters: Prince Raoden of Arelon, Princess Sarene of Teod, and the priest Hrathen of Fjorden. At the beginning of the story, Raoden is cursed by an ancient transformation known as the Shaod and secretly exiled to the city of Elantris just days before his betrothed, princess Sarene of Teod, arrives for their wedding. As Raoden tries to avoid gangs, keep his sanity, and unite the people of Elantris, Sarene must cope with the loss of her husband-to-be and try to save Arelon from Hrathen, a priest tasked with converting all of Arelon to the religion of Fjorden or dooming it to destruction.\n\n\n== Plot summary ==\nElantris was once a place of magic, and the immortal Elantrians were gods in the eyes of people, with the divine ability to create and heal with a mere wave of a hand. Anyone in Arelon had the potential to become an Elantrian through a magical transformation known as the Shaod. But ten years ago, a cataclysm known as the Reod somehow destroyed the magic of Elantris, the inhabitants of the city became \"cursed,\" and the city was sealed off from society. Anyone affected by the Shaod is now thrown into Elantris to stay there forever, still immortal, but cursed with unquenchable hunger and unhealable pain.\nThe book focuses on three principal characters whose stories intertwine. Much of the book occurs in groupings of three chapters, one for each of the three main characters. The majority of the story takes place within the country of Arelon.\n\n\n=== Main characters ===\nThere are three main point-of-view characters in the story:\n\nPrince Raoden, the prince of Arelon, is transformed into an Elantrian at the beginning of the book. After the Reod, Elantrians were cursed with dark splotches on their skin and hair falling out. The cursed cannot die or be killed except by drastic measures, such as burning or beheading. A major part of the curse is that their bodies can not repair themselves, so they continue to feel the pain of a stubbed toe or bruise forever. Over time the minor injuries accumulate, eventually driving them all insane. Elantrians do not need to eat, but they feel torturous hunger when they don't. Once Raoden is transformed, he is immediately sent to Elantris in secret while his father pretends he has suddenly died. Raoden's storyline centers on his efforts to retain his sanity and improve the Elantrian way of life beyond the anarchy to which it succumbed when Elantris fell. He does this by displaying amazing skills as a leader and getting the Elantrians to focus on work, as opposed to their constant suffering. He also manages to calm and disperse or incorporate the gangs which were terrorizing new Elantrians upon their arrival.\nPrincess Sarene is the princess of Teod and would have been Raoden's political bride had he not been cursed. Raoden has never personally met her, so it comes as a surprise to her when she discovers upon her arrival in Arelon that they are considered to have been married if either of them dies before the wedding. Widow of a supposedly dead prince and a new member of the mostly ill-suited Arelon nobility, she struggles to find out what exactly is going in all affairs concerning the nobility of Arelon, the downtrodden common people of Arelon and Elantris, and what exactly happened to her now deceased husband. Sarene's storyline follows her attempts to stabilize and improve the monarchy and political system, which encouraged nobles to mistreat the peasants. While spending her time in Arelon, she learns of Gyorn Hrathen, and relies upon her knowled",
        "metadata": {
            "title": "Elantris",
            "summary": "Elantris is a fantasy novel written by American fantasy and science fiction writer Brandon Sanderson. The book was published on April 21, 2005, by Tor Books and was Sanderson's first published book. The book gained generally positive reviews, and has been translated into multiple languages. Two related works, Hope of Elantris and The Emperor's Soul, have been released, and two additional novels in the series have been announced.\nThe story follows three main characters: Prince Raoden of Arelon, Princess Sarene of Teod, and the priest Hrathen of Fjorden. At the beginning of the story, Raoden is cursed by an ancient transformation known as the Shaod and secretly exiled to the city of Elantris just days before his betrothed, princess Sarene of Teod, arrives for their wedding. As Raoden tries to avoid gangs, keep his sanity, and unite the people of Elantris, Sarene must cope with the loss of her husband-to-be and try to save Arelon from Hrathen, a priest tasked with converting all of Arelon to the religion of Fjorden or dooming it to destruction.",
            "source": "https://en.wikipedia.org/wiki/Elantris",
            "cleaned": "Elantris is a fantasy novel written by Brandon Sanderson. It was published on April 21, 2005, by Tor Books. The book gained positive reviews and has been translated into multiple languages. Two related works, Hope of Elantris and The Emperor's Soul, have been released, and two more novels in the series have been announced.\nThe story follows three main characters: Prince Raoden of Arelon, Princess Sarene of Teod, and the priest Hrathen of Fjorden. Raoden is cursed and exiled to the city of Elantris. Sarene must cope with the loss of her betrothed and try to save Arelon from Hrathen, who wants to convert the people to the religion of Fjorden.\nElantris was once a place of magic, but a cataclysm known as the Reod destroyed its magic. The city became sealed off and anyone affected by the curse known as the Shaod is thrown into Elantris. The book focuses on the stories of Prince Raoden, Princess Sarene, and the cursed Elantrians. Raoden tries to improve life in Elantris, Sarene works to stabilize the monarchy, and the Elantrians suffer from unhealable pain and hunger.\nThe main characters are Prince Raoden, Princess Sarene, and the cursed Elantrians. Raoden is transformed into an Elantrian and tries to improve life in Elantris. Sarene is the princess of Teod and works to stabilize the monarchy. The Elantrians are cursed with unhealable pain and hunger.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "Trevor Joseph May (born September 23, 1989) is an American Twitch and YouTube streamer and former professional baseball pitcher. He played in Major League Baseball (MLB) for the Minnesota Twins, New York Mets, and the Oakland Athletics from 2014 to 2023. May is also a part-owner of the Fan Controlled Football's (FCF) FCF Zappers.\n\n\n== High school ==\nMay attended Kelso High School in Kelso, Washington.  In his senior year, he led the Hilanders to a 25–2 win–loss record, and a second-place finish at the 3A Washington Interscholastic Activities Association baseball championships.  He had signed a letter of intent to play at the University of Washington.  May was named 3A State Player of the Year by the Washington State Baseball Coaches Association.  He graduated in 2008 as class valedictorian.\n\n\n== Professional career ==\n\n\n=== Philadelphia Phillies ===\nThe Philadelphia Phillies selected May in the fourth round of the 2008 Major League Baseball draft. Prior to the 2011 season, May was the Phillies best prospect according to Baseball America That season, while pitching for the Clearwater Threshers, he went 10–8 with a 3.63 earned run average and 208 strikeouts in 151 innings pitched. After the season, he won the Paul Owens Award, which is awarded to the Phillies best minor league pitcher.Prior to the 2012 season, May was the Phillies' best prospect according to Baseball America. He was ranked 69th in all of baseball.\n\n\n=== Minnesota Twins ===\nOn December 6, 2012, the Phillies traded May, along with Vance Worley, to the Minnesota Twins for Ben Revere. May was named to the 2014 All-Star Futures Game, but withdrew due to injury.May made his major league debut on August 9, 2014, against the Oakland Athletics. He had been pitching well for the Rochester Red Wings of the Class AAA International League, but lasted only two innings, throwing 28 of 63 pitches for strikes, walking seven, allowing four earned runs, and not striking out a batter. May got his first major league win on September 3, 2014, as the Twins beat the Chicago White Sox at home, 11–4. He pitched 5+1⁄3 innings allowing six hits and three earned runs while striking out six.In 2016, May was 2–2 with a 5.27 ERA as a reliever, before his season ended with a back injury that was diagnosed as a stress fracture. In March 2017 an MRI revealed that May had a tear in his ulnar collateral ligament in his pitching elbow. On March 21, it was revealed that May would undergo Tommy John surgery, therefore ending his 2017 season.May began the 2018 season on the 60-day disabled list. He was activated on June 6, and optioned to Triple-A. For the Twins in 2019, May recorded a 2.94 ERA and 5–3 record with 79 strikeouts in 64+1⁄3 innings pitched. In 2020, May had an ERA of 3.86 in 23+1⁄3 innings with 38 strikeouts.\n\n\n=== New York Mets ===\nOn December 2, 2020, May signed a two-year contract worth $15.5 million with the New York Mets. In 2021, May pitched in a career-high 68 games and posted a 7–3 record with a 3.59 ERA and 83 strikeouts in 62+2⁄3 innings.\nOn May 15, 2022, May was placed on the 60-day injured list with a stress reaction in the lower portion of his humerus. He was activated on August 3, alongside Darin Ruf and Mychal Givens.\n\n\n=== Oakland Athletics ===\nOn December 16, 2022, May signed a one-year contract with the Oakland Athletics. He made 49 appearances for the Athletics in 2023, registering a 3.28 ERA with 40 strikeouts and a career–high 21 saves in 46+2⁄3 innings pitched. Following the season on October 16, 2023, May announced his retirement from baseball via Twitch, and in the process, spoke negatively about Athletics owner John Fisher and his plans to move the team to Las Vegas.\n\n\n== Personal life ==\nMay has an avid interest in electronic music, previously using the pseudonym DJ HEYBEEF; more recently, DJ MAZR, and streams on Twitch. May described himself as \"a partnered Twitch Streamer, a DJ, a Social Media connoisseur, an esports Entrepreneur, a gaming tournament organizer ",
        "metadata": {
            "title": "Trevor May",
            "summary": "Trevor Joseph May (born September 23, 1989) is an American Twitch and YouTube streamer and former professional baseball pitcher. He played in Major League Baseball (MLB) for the Minnesota Twins, New York Mets, and the Oakland Athletics from 2014 to 2023. May is also a part-owner of the Fan Controlled Football's (FCF) FCF Zappers.",
            "source": "https://en.wikipedia.org/wiki/Trevor_May",
            "cleaned": "Trevor Joseph May is an American Twitch and YouTube streamer and former professional baseball pitcher. He played in Major League Baseball (MLB) for the Minnesota Twins, New York Mets, and the Oakland Athletics from 2014 to 2023. May is also a part-owner of the Fan Controlled Football's (FCF) FCF Zappers.\nMay attended Kelso High School in Kelso, Washington. In his senior year, he led the Hilanders to a 25–2 win–loss record, and a second-place finish at the 3A Washington Interscholastic Activities Association baseball championships. He had signed a letter of intent to play at the University of Washington. May was named 3A State Player of the Year by the Washington State Baseball Coaches Association. He graduated in 2008 as class valedictorian.\nThe Philadelphia Phillies selected May in the fourth round of the 2008 Major League Baseball draft. Prior to the 2011 season, May was the Phillies best prospect according to Baseball America. That season, while pitching for the Clearwater Threshers, he went 10–8 with a 3.63 earned run average and 208 strikeouts in 151 innings pitched. After the season, he won the Paul Owens Award, which is awarded to the Phillies best minor league pitcher. Prior to the 2012 season, May was the Phillies' best prospect according to Baseball America. He was ranked 69th in all of baseball.\nOn December 6, 2012, the Phillies traded May, along with Vance Worley, to the Minnesota Twins for Ben Revere. May was named to the 2014 All-Star Futures Game, but withdrew due to injury. May made his major league debut on August 9, 2014, against the Oakland Athletics. He had been pitching well for the Rochester Red Wings of the Class AAA International League, but lasted only two innings, throwing 28 of 63 pitches for strikes, walking seven, allowing four earned runs, and not striking out a batter. May got his first major league win on September 3, 2014, as the Twins beat the Chicago White Sox at home, 11–4. He pitched 5+1⁄3 innings allowing six hits and three earned runs while striking out six. In 2016, May was 2–2 with a 5.27 ERA as a reliever, before his season ended with a back injury that was diagnosed as a stress fracture. In March 2017 an MRI revealed that May had a tear in his ulnar collateral ligament in his pitching elbow. On March 21, it was revealed that May would undergo Tommy John surgery, therefore ending his 2017 season. May began the 2018 season on the 60-day disabled list. He was activated on June 6, and optioned to Triple-A. For the Twins in 2019, May recorded a 2.94 ERA and 5–3 record with 79 strikeouts in 64+1⁄3 innings pitched. In 2020, May had an ERA of 3.86 in 23+1⁄3 innings with 38 strikeouts.\nOn December 2, 2020, May signed a two-year contract worth $15.5 million with the New York Mets. In 2021, May pitched in a career-high 68 games and posted a 7–3 record with a 3.59 ERA and 83 strikeouts in 62+2⁄3 innings. On May 15, 2022, May was placed on the 60-day injured list with a stress reaction in the lower portion of his humerus. He was activated on August 3, alongside Darin Ruf and Mychal Givens.\nOn December 16, 2022, May signed a one-year contract with the Oakland Athletics. He made 49 appearances for the Athletics in 2023, registering a 3.28 ERA with 40 strikeouts and a career–high 21 saves in 46+2⁄3 innings pitched. Following the season on October 16, 2023, May announced his retirement from baseball via Twitch, and in the process, spoke negatively about Athletics owner John Fisher and his plans to move the team to Las Vegas.\nMay has an avid interest in electronic music, previously using the pseudonym DJ HEYBEEF; more recently, DJ MAZR, and streams on Twitch. May described himself as \"a partnered Twitch Streamer, a DJ, a Social Media connoisseur, an esports Entrepreneur, a gaming tournament organizer.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "In literature, an epigraph is a phrase, quotation, or poem that is set at the beginning of a document, monograph or section or chapter thereof. The epigraph may serve as a preface to the work; as a summary; as a counter-example; or as a link from the work to a wider literary canon, with the purpose of either inviting comparison or enlisting a conventional context.A book may have an overall epigraph that is part of the front matter, or one for each chapter.\n\n\n== Examples ==\nAs the epigraph to The Sum of All Fears, Tom Clancy quotes Winston Churchill in the context of thermonuclear war:Why, you may take the most gallant sailor, the most intrepid airman or the most audacious soldier, put them at a table together – what do you get? The sum of their fears.\nSir Walter Scott frequently used epigraphs in his historical novels, including throughout his Waverley novels.\nThe long quotation from Dante's Inferno that prefaces T. S. Eliot's \"The Love Song of J. Alfred Prufrock\" is part of a speech by one of the damned in Dante's Hell.\nThe epigraph to E. L. Doctorow's Ragtime quotes Scott Joplin's instructions to those who play his music, \"Do not play this piece fast. It is never right to play ragtime fast.\"\nThe epigraph to Fyodor Dostoyevsky's The Brothers Karamazov is John 12:24: \"Verily, verily, I say unto you, except a corn of wheat fall into the ground and die, it abideth alone: but if it die, it bringeth forth much fruit.\"\nThe epigraph to Eliot's Gerontion is a quotation from Shakespeare's Measure for Measure.\nEliot's \"The Hollow Men\" uses the line \"Mistah Kurtz, he dead\" from Joseph Conrad's Heart of Darkness as one of its two epigraphs.\nAs an epigraph to The Sun Also Rises, Ernest Hemingway quotes Gertrude Stein, \"You are all a lost generation.\"\nThe epigraph to Theodore Herzl's Altneuland is \"If you will it, it is no dream...\" which became a slogan of the Zionist movement.\nLouis Antoine de Saint-Just's line \"Nobody can rule guiltlessly\" appears before chapter one in Arthur Koestler's 1940 anti-totalitarian novel Darkness at Noon.\nA Samuel Johnson quotation serves as an epigraph in Hunter S. Thompson's novel Fear and Loathing in Las Vegas: \"He who makes a beast of himself gets rid of the pain of being a man.\"\nStephen King uses many epigraphs in his writing, usually to mark the beginning of another section in a novel. An unusual example is The Stand wherein he uses lyrics from certain songs to express the metaphor used in a particular part.Jack London uses the first stanza of John Myers O'Hara's poem \"Atavism\" as the epigraph to The Call of the Wild.\nCormac McCarthy opens his 1985 novel Blood Meridian with three epigraphs: quotations from French writer and philosopher Paul Valéry, from German Christian mystic and Gnostic Jacob Boehme, and a 1982 news clipping from the Yuma Sun reporting the claim of members of an Ethiopian archeological excavation that a fossilized skull three hundred millennia old seemed to have been scalped.\nThe epigraphs to the preamble of Georges Perec's Life: A User's Manual (La Vie mode d'emploi) and to the book as a whole warn the reader that tricks are going to be played and that all will not be what it seems.J. K. Rowling's novels frequently begin with epigraphs relating to the themes explored. For example, Harry Potter and the Deathly Hallows opens with two: a quotation from Aeschylus's tragedy The Libation Bearers and a quotation from William Penn.\nQuotation from Woodrow Wilson's The State on the title page of every issue of The Bohemian Review, a magazine endorsing independence of Czechs and Slovaks to Austria-Hungary in 1917–1918 (example).\n\n\n=== Fictional quotations ===\nSome writers use as epigraphs fictional quotations that purport to be related to the fiction of the work itself. Examples include:\n\n\n==== In films ====\nThe film Talladega Nights: The Ballad of Ricky Bobby opens with a fictional quotation attributed to Eleanor Roosevelt for comedic effect.\n\n\n==== In literature ====\nSome science fiction work",
        "metadata": {
            "title": "Epigraph (literature)",
            "summary": "In literature, an epigraph is a phrase, quotation, or poem that is set at the beginning of a document, monograph or section or chapter thereof. The epigraph may serve as a preface to the work; as a summary; as a counter-example; or as a link from the work to a wider literary canon, with the purpose of either inviting comparison or enlisting a conventional context.A book may have an overall epigraph that is part of the front matter, or one for each chapter.",
            "source": "https://en.wikipedia.org/wiki/Epigraph_(literature)",
            "cleaned": "- An epigraph is a phrase, quotation, or poem set at the beginning of a document, monograph, section, or chapter.\n- It can serve as a preface, summary, counter-example, or link to a wider literary canon.\n- A book may have an overall epigraph or one for each chapter.\n- Examples of epigraphs include quotes from Winston Churchill, Dante's Inferno, Scott Joplin, John 12:24, Shakespeare's Measure for Measure, Joseph Conrad's Heart of Darkness, Gertrude Stein, and Samuel Johnson.\n- Stephen King and Jack London also use epigraphs in their writing.\n- Fictional quotations can be used as epigraphs, such as in the film Talladega Nights: The Ballad of Ricky Bobby.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "The Way of Kings is an epic fantasy novel written by American author Brandon Sanderson and the first book in The Stormlight Archive series. The novel was published on August 31, 2010, by Tor Books. The Way of Kings consists of one prelude, one prologue, 75 chapters, an epilogue and nine interludes. It was followed by Words of Radiance in 2014, Oathbringer in 2017, Rhythm of War in 2020 and Wind and Truth in 2024. A leatherbound edition was released in 2021.In 2011, it won the David Gemmell Legend Award for best novel. The unabridged audiobook is read by narrator team Michael Kramer and Kate Reading.\n\n\n== Development ==\nSanderson started working on pieces of The Way of Kings in the late 1990s. Some characters and scenes, particularly Bridge Four, originated in Dragonsteel, Sanderson's Honors thesis at Brigham Young University which was completed in 2000. The finished first draft of The Way of Kings was completed in 2003. Sanderson approached Tor with the book at this time, and while they were interested decided that \"something wasn’t quite right\" and declined to publish it. Its further development was delayed when Sanderson instead decided to focus on the first Mistborn trilogy, which was published from 2006 to 2008. Returning to the task in the late 2000s, Sanderson indicated that he \"threw away everything, and started on page one again.\"On June 10, 2010, the prologue and the first three chapters of the book were released, along with an introduction by Sanderson, as a preview on the Tor website. On July 8, 2010, the next three chapters (4–6) were released in audio format. On August 5, 2010, chapters 9 and 11 were released. Tor wrote that they did not release chapters 7, 8, and 10 because they wanted to focus on the storyline of Kaladin, one of the main characters. On August 26, 2010, chapters 12 and 13 were released.Some of the early drafts have been made available in the years since. The original Dragonsteel text is still in possession of Brigham Young University, and several Dragonsteel era Bridge Four chapters were released on Sanderson's website in 2017. The 2003 draft, retroactively entitled The Way of Kings Prime, was made available in its entirety on Sanderson's website in 2020.\n\n\n== Summary ==\nThe story rotates between the points of view of Kaladin, Shallan Davar, Szeth-son-son-Vallano, Dalinar Kholin, Adolin Kholin, and several other minor characters, who lead seemingly unconnected lives.\n\n\n== Plot ==\n\n\n=== Prelude ===\n4500 years ago, a catastrophic war known as the Last Desolation ended when mankind fought victoriously against their enemies known as the Voidbringers. Devastated by the war and mass casualties, The Herald Kalak meets up with Jezrien upon learning that the other Heralds had renounced their Oathpact and abandoned their Shardblades. Jezrien announced to Kalak that they must remain secret for their departure and left his Shardblade behind in despair while Kalak left his sword feeling heartbroken.\n\n\n=== Prologue ===\nSzeth, a Shin man cast out by his people and condemned to obey his constantly changing masters, is sent to assassinate the king of one of the world's most powerful nations, Alethkar. As the story progresses, he continuously changes hands, doing his best to hide the fact that he possesses an Honorblade, a mythical blade used by the Heralds that can cut through any material. He also possesses access to powers that are no longer available to normal humans (“Surgebinding”), once possessed by the Knights Radiant and thought lost, making him incredibly difficult to defeat in battle.\nWithin the palace of Kholinar, Szeth sneaks into the hallway and uses his Surgebinding abilities to outmaneuver the king's guards. Within the king's chambers, Szeth confronts King Gavilar covered in armored Shardplate. Szeth defeats the king by causing the balcony he is standing on to collapse, mortally wounding him. Szeth reveals to the King that he was sent by the Parshendi to kill him. Before Szeth flees the scene, a dy",
        "metadata": {
            "title": "The Way of Kings",
            "summary": "The Way of Kings is an epic fantasy novel written by American author Brandon Sanderson and the first book in The Stormlight Archive series. The novel was published on August 31, 2010, by Tor Books. The Way of Kings consists of one prelude, one prologue, 75 chapters, an epilogue and nine interludes. It was followed by Words of Radiance in 2014, Oathbringer in 2017, Rhythm of War in 2020 and Wind and Truth in 2024. A leatherbound edition was released in 2021.In 2011, it won the David Gemmell Legend Award for best novel. The unabridged audiobook is read by narrator team Michael Kramer and Kate Reading.",
            "source": "https://en.wikipedia.org/wiki/The_Way_of_Kings",
            "cleaned": "\"The Way of Kings\" is an epic fantasy novel written by Brandon Sanderson. It is the first book in \"The Stormlight Archive\" series. The novel was published on August 31, 2010, by Tor Books. It consists of one prelude, one prologue, 75 chapters, an epilogue, and nine interludes. The book won the David Gemmell Legend Award for best novel in 2011. Sanderson started working on the book in the late 1990s and completed the first draft in 2003. After some revisions, the prologue and the first three chapters were released as a preview in 2010. The story follows the perspectives of various characters, including Kaladin, Shallan Davar, Szeth-son-son-Vallano, Dalinar Kholin, and Adolin Kholin.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "The caper story is a subgenre of crime fiction.  The typical caper story involves one or more crimes (especially thefts, swindles, or occasionally kidnappings) perpetrated by the main characters in full view of the reader. The actions of police or detectives attempting to prevent or solve the crimes may also be chronicled, but are not the main focus of the story. \nThe caper story is distinguished from the straight crime story by elements of humor, adventure, or unusual cleverness or audacity. The main characters often have comical idiosyncrasies and the law enforcement individuals are characterized by ineptitude or inadequacies. The criminals comically plan a crime with details unnecessary for the nature of the crime and humour is created when their personalities clash and their quirks are exposed.  For instance, the Dortmunder stories of Donald E. Westlake are highly comic tales involving unusual thefts by a gang of offbeat characters — in different stories Dortmunder's gang steals the same gem several times, steals an entire branch bank, and kidnaps someone from an asylum by driving a stolen train onto the property.  By contrast, the same author's Parker stories (published under the name Richard Stark) are grimly straightforward accounts of mundane crime — the criminal equivalent of the police procedural. Others, such as Lawrence Block's Bernie Rhodenbarr novels, feature a role reversal, an honest criminal and crooked cop, and the use of burglar Rhodenbarr's criminal talents to solve murders.\nA caper may appear as a subplot in a larger work.  For example, Tom Sawyer's plot to steal Jim out of slavery in the last part of Huckleberry Finn is a classic caper.\n\n\n== Etymology ==\nThe verb to caper means to leap in a frolicsome way, and probably derives from capriole, which derives from the Latin for goat (Capra). The noun caper means a frolicsome leap, a capricious escapade or an illegal or questionable act.\n\n\n== Examples ==\n\n\n=== Literature ===\n\"Arsène Lupin, Gentleman Burglar\" (1907) by Maurice Leblanc\n\"The Ransom of Red Chief\" (1910) by O. Henry: two kidnappers find that the little boy they are holding for ransom is more dangerous than the law\nearly stories of \"The Saint\" (beginning in 1928) by Leslie Charteris\nThe Asphalt Jungle (1949) by W. R. Burnett, adapted for film in 1950, 1958, 1963 and 1972\nnovels by John Boland such as The League of Gentlemen (1958)  and The Golden Fleece (1961)\nThe Light of Day (1962) by Eric Ambler (filmed as Topkapi)\nthe Modesty Blaise stories (beginning in 1963) of Peter O'Donnell\nthe John Dortmunder series (beginning in 1970) and other novels by Donald E. Westlake\nSledgehammer (1971) by Walter Wager\nA Tough One to Lose (1972) by Tony Kenrick, who is often compared with Westlake — an entire airplane and hundreds of passengers go missing; how did this happen?\nThe Taking of Pelham One Two Three (1973) by John Godey— a subway car is hijacked and held for ransom\nThe Great Train Robbery (1975) by Michael Crichton\nStealing Lillian (1975) by Tony Kenrick — A con artist is enlisted to stage a kidnapping to capture some terrorists (film rights were purchased, according to the dust jacket, but the film was never made)\nThe Seven Day Soldiers (1976) by Tony Kenrick — three suburbanites rob a bank by mail, then must battle the mafioso whom they robbed (film rights were purchased, to be directed by Robert Aldrich and to star Steve McQueen, according to the dust jacket, but the film was never made)\nFaraday's Flowers (1978) — adapted as Shanghai Surprise\nTwo Lucky People (1981) by Tony Kenrick — A man and woman, both with only weeks to live, decide to spend their last days defeating a criminal ... in a farcical way.\nGlitterbug (1991) by Tony Kenrick — An amnesiac must deal with the many criminals who made him this way (film rights were purchased by TriStar Pictures to be a vehicle for Bruce Willis, but the film was never made)\nSwindle (2008) By Gordon Korman\nMistborn: The Final Empire (2006) By Brandon Sanderson\n",
        "metadata": {
            "title": "Caper story",
            "summary": "The caper story is a subgenre of crime fiction.  The typical caper story involves one or more crimes (especially thefts, swindles, or occasionally kidnappings) perpetrated by the main characters in full view of the reader. The actions of police or detectives attempting to prevent or solve the crimes may also be chronicled, but are not the main focus of the story. \nThe caper story is distinguished from the straight crime story by elements of humor, adventure, or unusual cleverness or audacity. The main characters often have comical idiosyncrasies and the law enforcement individuals are characterized by ineptitude or inadequacies. The criminals comically plan a crime with details unnecessary for the nature of the crime and humour is created when their personalities clash and their quirks are exposed.  For instance, the Dortmunder stories of Donald E. Westlake are highly comic tales involving unusual thefts by a gang of offbeat characters — in different stories Dortmunder's gang steals the same gem several times, steals an entire branch bank, and kidnaps someone from an asylum by driving a stolen train onto the property.  By contrast, the same author's Parker stories (published under the name Richard Stark) are grimly straightforward accounts of mundane crime — the criminal equivalent of the police procedural. Others, such as Lawrence Block's Bernie Rhodenbarr novels, feature a role reversal, an honest criminal and crooked cop, and the use of burglar Rhodenbarr's criminal talents to solve murders.\nA caper may appear as a subplot in a larger work.  For example, Tom Sawyer's plot to steal Jim out of slavery in the last part of Huckleberry Finn is a classic caper.",
            "source": "https://en.wikipedia.org/wiki/Caper_story",
            "cleaned": "The caper story is a subgenre of crime fiction.\nThe typical caper story involves one or more crimes perpetrated by the main characters in full view of the reader.\nThe actions of police or detectives attempting to prevent or solve the crimes may also be chronicled, but are not the main focus of the story.\nThe caper story is distinguished from the straight crime story by elements of humor, adventure, or unusual cleverness or audacity.\nThe main characters often have comical idiosyncrasies and the law enforcement individuals are characterized by ineptitude or inadequacies.\nThe criminals comically plan a crime with unnecessary details and humor is created when their personalities clash and their quirks are exposed.\nThe Dortmunder stories of Donald E. Westlake are highly comic tales involving unusual thefts by a gang of offbeat characters.\nThe same author's Parker stories (published under the name Richard Stark) are grimly straightforward accounts of mundane crime.\nLawrence Block's Bernie Rhodenbarr novels feature a role reversal, an honest criminal and crooked cop, and the use of burglar Rhodenbarr's criminal talents to solve murders.\nA caper may appear as a subplot in a larger work.\nThe verb to caper means to leap in a frolicsome way.\nThe noun caper means a frolicsome leap, a capricious escapade or an illegal or questionable act.\nExamples of caper stories in literature include \"Arsène Lupin, Gentleman Burglar\" by Maurice Leblanc, \"The Ransom of Red Chief\" by O. Henry, early stories of \"The Saint\" by Leslie Charteris, The Asphalt Jungle by W. R. Burnett, novels by John Boland, The Light of Day by Eric Ambler, the Modesty Blaise stories of Peter O'Donnell, the John Dortmunder series by Donald E. Westlake, Sledgehammer by Walter Wager, A Tough One to Lose by Tony Kenrick, The Taking of Pelham One Two Three by John Godey, The Great Train Robbery by Michael Crichton, Stealing Lillian by Tony Kenrick, The Seven Day Soldiers by Tony Kenrick, Faraday's Flowers, Two Lucky People by Tony Kenrick, Glitterbug by Tony Kenrick, Swindle by Gordon Korman, and Mistborn: The Final Empire by Brandon Sanderson.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "The name Zane may be a given name or a surname. Its western usage derives from the Venetian form of Gianni or an alternate spelling of the German and Jewish name Zahn. Zane can also refer to the Arabic personal name more commonly spelt Zain meaning \"beautiful\" or \"handsome\".  It was popularized as a given name in the early 20th century through the American writer Zane Grey. Zayne is an alternative spelling.\nNotable people with the name Zane or Zayne include:\n\n\n== Given name ==\n\n\n=== Zane ===\nZane Banks (born 1986), Australian guitarist\nZane Beadles (born 1986), American football player\nZane Buzby, American actress\nZane Copeland (born 1982), American rapper better known as \"Lil' Zane\"\nZane Eglīte (born 1984), Latvian basketball player\nZayne Emory (born 1998), American actor\nZane Francis, Australian singer and Triple J Unearthed National Indigenous Winner at the National Indigenous Music Awards 2015\nZane Floyd (born 1976), American murderer\nZane Frazier (born 1966), American martial artist\nZane Gonzalez (born 1995), American football player\nZane Green (born 1996), Namibian cricketer\nZane Grey (1872–1939), American author\nZane C. Hodges (1932–2008), American pastor\nZane Holtz (born 1987), Canadian actor\nZane Huett (born 1997), American actor\nZane Jākobsone (born 1985), Latvian basketball player\nZane Jordan (born 1991), Zambian swimmer\nZane Kirchner (born 1984), South African rugby player\nZane Lamprey (born 1976), American comedian and actor\nZane Lewis (born 1981), American painter\nZane Lowe (born 1973), New Zealand radio presenter\nZane Maloney (born 2003), Barbadian racing driver\nZane McIntyre (born 1992), American ice hockey player\nZane Musa (1979–2015), American saxophonist\nZane Navratil (born 1995), a professional pickleball player\nZane Radcliffe (born 1969), British writer\nZane Reynosa (born 1975), American hip hop artist and fashion designer\nZane Robertson (born 1989), New Zealand runner\nZane Schwenk (born 1975), American wakeboarder\nZane Scotland (born 1982), British golfer\nZane Smith (born 1960), American baseball player\nZane Tamane (born 1983), Latvian basketball player\nZane Taylor (born 1988), American football player\nZane Tetavano (born 1990), Australian rugby league player\nZane Williams (born 1977), American country music singer\nZane Winslade (born 1983), New Zealand rugby player\n\n\n== Surname ==\nThe pioneer Zane family in the United States, which includes:\nRobert Zane, English Quaker ancestor of P. Zane Grey, who came to the North American colonies in 1673\nEbenezer Zane (1747–1811), American pioneer, founder of Zanesville Ohio\nBetty Zane (1759–1823), sister of Ebenezer\nAlex Zane (born 1979), British television and radio presenter\nArnie Zane (1947–1988), American dancer and choreographer\nBilly Zane (born 1966), American actor\nCarolyn Zane (born 1958), American romance novelist\nCharles S. Zane (1831–1915), American judge and first chief justice of the Utah Supreme Court\nClayton Zane (born 1977), Australian soccer player\nFrank Zane (born 1942), American bodybuilder and teacher\nGheorghe Zane (1897–1978), Romanian economist\nJoe Zane (born 1971), American artist\nJohn Maxcy Zane (1863–1937), American lawyer\nJohn Peder Zane (born 1962), American journalist\nLisa Zane (born 1961), American actress\nMatt Zane (born 1974), American musician\nMatteo Zane (died 1605), Patriarch of Venice from 1600 to 1605\nRandolph Zane (1887–1918), American marine\nRaymond Zane (born 1939), American politician\n\n\n== Pseudonyms ==\nZane (author) is a pseudonym of Kristina Laferne Roberts, author of erotic fiction novels\n\n\n== Characters ==\nZane (Ninjago), a character in Ninjago\nZane Bennett in the television series H2O: Just Add Water, played by Burgess Abernethy\nZane Cobriana in The Kiesha'ra novels by Amelia Atwater-Rhodes\nZane Donovan in the American television series Eureka\nZane Park in Degrassi: The Next Generation\nZane Truesdale in the Yu-Gi-Oh! GX anime and manga series\nZane Yama in the Marvel Comics universe\nZane Zaminski in the 1996 film The Arriv",
        "metadata": {
            "title": "Zane",
            "summary": "The name Zane may be a given name or a surname. Its western usage derives from the Venetian form of Gianni or an alternate spelling of the German and Jewish name Zahn. Zane can also refer to the Arabic personal name more commonly spelt Zain meaning \"beautiful\" or \"handsome\".  It was popularized as a given name in the early 20th century through the American writer Zane Grey. Zayne is an alternative spelling.\nNotable people with the name Zane or Zayne include:",
            "source": "https://en.wikipedia.org/wiki/Zane",
            "cleaned": "Zane is a given name or surname. It is derived from the Venetian form of Gianni or an alternate spelling of the German and Jewish name Zahn. Zane can also refer to the Arabic personal name Zain, meaning \"beautiful\" or \"handsome\". It became popular as a given name in the early 20th century through the American writer Zane Grey. Zayne is an alternative spelling.\n\nNotable people with the given name Zane or Zayne include:\n- Zane Banks (born 1986), Australian guitarist\n- Zane Beadles (born 1986), American football player\n- Zane Buzby, American actress\n- Zane Copeland (born 1982), American rapper better known as \"Lil' Zane\"\n- Zane Eglīte (born 1984), Latvian basketball player\n- Zayne Emory (born 1998), American actor\n- Zane Francis, Australian singer and Triple J Unearthed National Indigenous Winner at the National Indigenous Music Awards 2015\n- Zane Floyd (born 1976), American murderer\n- Zane Frazier (born 1966), American martial artist\n- Zane Gonzalez (born 1995), American football player\n- Zane Green (born 1996), Namibian cricketer\n- Zane Grey (1872–1939), American author\n- Zane C. Hodges (1932–2008), American pastor\n- Zane Holtz (born 1987), Canadian actor\n- Zane Huett (born 1997), American actor\n- Zane Jākobsone (born 1985), Latvian basketball player\n- Zane Jordan (born 1991), Zambian swimmer\n- Zane Kirchner (born 1984), South African rugby player\n- Zane Lamprey (born 1976), American comedian and actor\n- Zane Lewis (born 1981), American painter\n- Zane Lowe (born 1973), New Zealand radio presenter\n- Zane Maloney (born 2003), Barbadian racing driver\n- Zane McIntyre (born 1992), American ice hockey player\n- Zane Musa (1979–2015), American saxophonist\n- Zane Navratil (born 1995), professional pickleball player\n- Zane Radcliffe (born 1969), British writer\n- Zane Reynosa (born 1975), American hip hop artist and fashion designer\n- Zane Robertson (born 1989), New Zealand runner\n- Zane Schwenk (born 1975), American wakeboarder\n- Zane Scotland (born 1982), British golfer\n- Zane Smith (born 1960), American baseball player\n- Zane Tamane (born 1983), Latvian basketball player\n- Zane Taylor (born 1988), American football player\n- Zane Tetavano (born 1990), Australian rugby league player\n- Zane Williams (born 1977), American country music singer\n- Zane Winslade (born 1983), New Zealand rugby player\n\nThe Zane surname is associated with the pioneer Zane family in the United States. Notable individuals with the surname include:\n- Robert Zane, English Quaker ancestor of P. Zane Grey, who came to the North American colonies in 1673\n- Ebenezer Zane (1747–1811), American pioneer, founder of Zanesville Ohio\n- Betty Zane (1759–1823), sister of Ebenezer\n- Alex Zane (born 1979), British television and radio presenter\n- Arnie Zane (1947–1988), American dancer and choreographer\n- Billy Zane (born 1966), American actor\n- Carolyn Zane (born 1958), American romance novelist\n- Charles S. Zane (1831–1915), American judge and first chief justice of the Utah Supreme Court\n- Clayton Zane (born 1977), Australian soccer player\n- Frank Zane (born 1942), American bodybuilder and teacher\n- Gheorghe Zane (1897–1978), Romanian economist\n- Joe Zane (born 1971), American artist\n- John Maxcy Zane (1863–1937), American lawyer\n- John Peder Zane (born 1962), American journalist\n- Lisa Zane (born 1961), American actress\n- Matt Zane (born 1974), American musician\n- Matteo Zane (died 1605), Patriarch of Venice from 1600 to 1605\n- Randolph Zane (1887–1918), American marine\n- Raymond Zane (born 1939), American politician\n\nZane is also a pseudonym used by Kristina Laferne Roberts, author of erotic fiction novels.\n\nIn addition, Zane is a character in Ninjago, Zane Bennett in the television series H2O: Just Add Water, Zane Cobriana in The Kiesha'ra novels by Amelia Atwater-Rhodes, Zane Donovan in the American television series Eureka, Zane Park in Degrassi: The Next Generation, Zane Truesdale in the Yu-Gi-Oh! GX anime and manga series, Zane Yama in the Marvel Comics universe, and Zane Zaminski in the 1996 film The Arrival.",
            "context": "Mistborn"
        }
    },
    {
        "page_content": "The following is a list of unmade and unreleased animated projects by DreamWorks Animation. Some of these films or shows were, or still are, in development limbo. These also include the co-productions the studio collaborated with in the past (i.e. Oriental DreamWorks, Aardman Animations, Columbus 81 Productions, Bullwinkle Studios, World Events Productions, Double Dare You Productions, Scholastic Corporation and Amblin Entertainment), as well as sequels to their franchises.\n\n\n== 1990s ==\n\n\n=== 1991 ===\n\n\n=== 1998 ===\n\n\n=== 1999 ===\n\n\n== 2000s ==\n\n\n=== 2000 ===\n\n\n=== 2001 ===\n\n\n=== 2002 ===\n\n\n=== 2005 ===\n\n\n=== 2006 ===\n\n\n=== 2007 ===\n\n\n=== 2008 ===\n\n\n=== 2009 ===\n\n\n== 2010s ==\nIn the 2010s, several films were announced to be made that were to be released in the next 3–4 years following their announcements. Some of these films were eventually cancelled while others are claimed to be in development and waiting for a release. Most of these films were cancelled due to massive layoffs, creative differences, management changes, no updates on the features, and Comcast eventually buying DreamWorks in 2016.\n\n\n=== 2010 ===\n\n\n=== 2011 ===\n\n\n=== 2012 ===\n\n\n=== 2013 ===\n\n\n=== 2014 ===\n\n\n=== 2015 ===\n\n\n=== 2017 ===\n\n\n=== 2018 ===\n\n\n== 2020s ==\n\n\n=== 2023 ===\n\n\n== See also ==\nList of DreamWorks Animation productions\nList of Illumination productions\nList of Universal Animation Studios productions\nList of Paramount Pictures theatrical animated feature films\nList of 20th Century Studios theatrical animated feature films\nList of Universal Pictures theatrical animated feature films\nList of unproduced Paramount Pictures animated projects\nList of unproduced 20th Century Studios animated projects\nList of unproduced Universal Pictures animated projects\n\n\n== References ==",
        "metadata": {
            "title": "List of unproduced DreamWorks Animation projects",
            "summary": "The following is a list of unmade and unreleased animated projects by DreamWorks Animation. Some of these films or shows were, or still are, in development limbo. These also include the co-productions the studio collaborated with in the past (i.e. Oriental DreamWorks, Aardman Animations, Columbus 81 Productions, Bullwinkle Studios, World Events Productions, Double Dare You Productions, Scholastic Corporation and Amblin Entertainment), as well as sequels to their franchises.",
            "source": "https://en.wikipedia.org/wiki/List_of_unproduced_DreamWorks_Animation_projects",
            "cleaned": "The list includes unmade and unreleased animated projects by DreamWorks Animation. It also mentions co-productions with other studios and sequels to their franchises. The list is categorized by decades, starting from the 1990s and going up to the 2020s. In the 2010s, several films were announced but some were cancelled due to various reasons. The list also includes references and related lists.",
            "context": "Mistborn"
        }
    }
]